import base64

from .lib_httprequest import *
from bs4 import BeautifulSoup
import os.path
# from urlparse import urlparse
import re
import json
import datetime
import sys
import requests
import shutil
from urllib.parse import unquote

httprequestObj = lib_httprequest()


class aecmarketing():
    name = 'aecmarketing'

    def __init__(self):

        try:
            import configs

        except ImportError:
            configs = {}

        self.encoding = 'utf-8'
        self.imgtmp = 'imgtmp'
        self.debug = 0
        self.debugresdata = 0
        self.parser = 'html.parser'
        # URL for Login/ Register
        self.url_reg = 'https://www.aecmarketinghome.com/th/user/register.html'
        self.url_login = 'https://www.aecmarketinghome.com/user/userlogin.html'
        self.sell_url = 'https://www.kobkid.com/market/post/sell'
        self.rent_url = 'https://www.kobkid.com/market/post/rental'
        # Headers used in the request
        self.headers = {
            'Connection': 'keep-alive',
            'Pragma': 'no-cache',
            'Cache-Control': 'no-cache',
            'Accept': '*/*',
            'Origin': 'https://www.aecmarketinghome.com',
            'X-Requested-With': 'XMLHttpRequest',
            'User-Agent': 'Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Ubuntu Chromium/79.0.3945.79 Chrome/79.0.3945.79 Safari/537.36',
            'Content-Type': 'application/x-www-form-urlencoded; charset=UTF-8',
            'Sec-Fetch-Site': 'same-origin',
            'Sec-Fetch-Mode': 'cors',
            'Referer': 'https://www.aecmarketinghome.com/th/profile.html',
            'Accept-Encoding': 'gzip, deflate, br',
            'Accept-Language': 'en-US,en;q=0.9',
        }


    def register_user(self, passdata):

        self.print_debug('function [' + sys._getframe().f_code.co_name + ']')
        start_time = datetime.datetime.now()

        first_name = passdata['name_th']
        last_name = passdata['surname_th']
        email = passdata['user']
        password = passdata['pass']

        # Data for registering the user
        register_data = {
          'user_firstname': first_name,
          'user_lastname': last_name,
          'user_email': email,
          'user_password': password
        }

        result = httprequestObj.http_post(self.url_reg, data=register_data, headers=self.headers)
        decoded_result = result.content.decode('utf-8')
        final_output = json.loads(decoded_result)

        # If User registeration is successful
        if (final_output['result']['status_code'] == 200):
            end_time = datetime.datetime.utcnow()
            detail = 'User Registration Successful'
            return {
                "success": True,
                "start_time": str(start_time),
                "end_time": str(end_time),
                "usage_time": str(end_time - start_time),
                "detail": detail,
                "websitename": "aecmarketing",
            }

        else:
            end_time = datetime.datetime.utcnow()
            detail = final_output['result']['description']
            return {
                "success": False,
                "start_time": str(start_time),
                "end_time": str(end_time),
                "usage_time": str(end_time - start_time),
                "detail": detail,
                "websitename": "aecmarketing",
            }

    def test_login(self, postdata):

        self.print_debug('function [' + sys._getframe().f_code.co_name + ']')
        time_start = datetime.datetime.utcnow()

        username = postdata['user']
        password = postdata['pass']

        # Data for User Login
        login_data = {
          'login_user': username,
          'login_password': password
        }

        # print(login_data)
        result = httprequestObj.http_post(self.url_login, data=login_data)
        decoded_result = result.content.decode('utf-8')
        final_output = json.loads(decoded_result)

        # Status of the Login Action
        status = final_output['result']['status_code']
        end_time = datetime.datetime.utcnow()

        if (status == 200):
            status = True
            detail = 'User Login Successful'

        else:
            status = False
            detail = final_output['result']['description']

        return {
            "success": status,
            "start_time": str(time_start),
            "end_time": str(end_time),
            "usage_time": str(end_time - time_start),
            "ds_id": postdata['ds_id'],
            "detail": detail,
            "websitename": "aecmarketing",
        }

    def create_post(self, postdata):

        start_time = datetime.datetime.utcnow()

        property_type = {
            1 : 3, 2 : 1, 3 : 2, 4: 2, 5 : 5, 6 : 6, 7 : 4, 8 : 4, 9 : 8, 10 : 7, 25 : 7
        }

        result = self.test_login(postdata)

        if(result['success'] == False):
            result['post_url'] = ''
            result['post_id'] = ''
            return result

        if(postdata['listing_type'] == 'เช่า'):
            post_type = 'RENTAL'
            post_type_no = 4

        else:
            post_type = 'SELL'
            post_type_no = 1

        if ('web_project_name' not in postdata) or (postdata['web_project_name'] == None):
            if 'project_name' in postdata and postdata['project_name'] != None:
                postdata['web_project_name'] = postdata['project_name']
            else:
                postdata['web_project_name'] = postdata['post_title_th']


        if(postdata['land_size_wa'] == None):
            area_sqw = ''
        else:
            area_sqw = postdata['land_size_wa']

        if(postdata['land_size_rai'] == None):
            area_rai = 0

        else:
            area_rai = postdata['land_size_rai']

        if(postdata['land_size_ngan'] == None):
            area_ngan = ''

        else:
            area_ngan = postdata['land_size_ngan']

        if(postdata['floor_area'] == None):
            living_area = ''

        else:
            living_area = postdata['floor_area']

        image_string = []
        if (postdata['post_images'] != None):
            allimages = postdata['post_images']
            for i in range(len(allimages)):
                with open(os.getcwd() + "/" + allimages[i], 'rb') as img_file:
                    encode = 'data:image/jpeg;base64,'+str(base64.b64encode(img_file.read()))[2:-1]
                image_string.append(encode)

        else:
            with open(os.getcwd() + "/"+'imgtmp/default/white.png', 'rb') as img_file:
                encode = 'data:image/jpeg;base64,' + str(base64.b64encode(img_file.read()))[2:-1]
            image_string.append(encode)

        zones = ['กรุงเทพฯ - พระนคร', 'กรุงเทพฯ - ดุสิต', 'กรุงเทพฯ - หนองจอก', 'กรุงเทพฯ - บางรัก', 'กรุงเทพฯ - บางเขน', 'กรุงเทพฯ - บางกะปิ', 'กรุงเทพฯ - ปทุมวัน', 'กรุงเทพฯ - ป้อมปราบศัตรูพ่าย', 'กรุงเทพฯ - พระโขนง', 'กรุงเทพฯ - มีนบุรี', 'กรุงเทพฯ - ลาดกระบัง', 'กรุงเทพฯ - ยานนาวา', 'กรุงเทพฯ - สัมพันธวงศ์', 'กรุงเทพฯ - พญาไท', 'กรุงเทพฯ - ธนบุรี', 'กรุงเทพฯ - บางกอกใหญ่', 'กรุงเทพฯ - ห้วยขวาง', 'กรุงเทพฯ - คลองสาน', 'กรุงเทพฯ - ตลิ่งชัน', 'กรุงเทพฯ - บางกอกน้อย', 'กรุงเทพฯ - บางขุนเทียน', 'กรุงเทพฯ - ภาษีเจริญ', 'กรุงเทพฯ - หนองแขม', 'กรุงเทพฯ - ราษฎร์บูรณะ', 'กรุงเทพฯ - บางพลัด', 'กรุงเทพฯ - ดินแดง', 'กรุงเทพฯ - บึงกุ่ม', 'กรุงเทพฯ - สาทร', 'กรุงเทพฯ - บางซื่อ', 'กรุงเทพฯ - จตุจักร', 'กรุงเทพฯ - บางคอแหลม', 'กรุงเทพฯ - ประเวศ', 'กรุงเทพฯ - คลองเตย', 'กรุงเทพฯ - สวนหลวง', 'กรุงเทพฯ - จอมทอง', 'กรุงเทพฯ - ดอนเมือง', 'กรุงเทพฯ - ราชเทวี', 'กรุงเทพฯ - ลาดพร้าว', 'กรุงเทพฯ - วัฒนา', 'กรุงเทพฯ - บางแค', 'กรุงเทพฯ - หลักสี่', 'กรุงเทพฯ - สายไหม', 'กรุงเทพฯ - คันนายาว', 'กรุงเทพฯ - สะพานสูง', 'กรุงเทพฯ - วังทองหลาง', 'กรุงเทพฯ - คลองสามวา', 'กรุงเทพฯ - บางนา', 'กรุงเทพฯ - ทวีวัฒนา', 'กรุงเทพฯ - ทุ่งครุ', 'กรุงเทพฯ - บางบอน', 'กรุงเทพฯ - บ้านทะวาย', 'สมุทรปราการ - เมืองสมุทรปราการ', 'สมุทรปราการ - บางบ่อ', 'สมุทรปราการ - บางพลี', 'สมุทรปราการ - พระประแดง', 'สมุทรปราการ - พระสมุทรเจดีย์', 'สมุทรปราการ - บางเสาธง', 'นนทบุรี - เมืองนนทบุรี', 'นนทบุรี - บางกรวย', 'นนทบุรี - บางใหญ่', 'นนทบุรี - บางบัวทอง', 'นนทบุรี - ไทรน้อย', 'นนทบุรี - ปากเกร็ด', 'นนทบุรี - เทศบาลนครนนทบุรี (สาขาแขวงท่าทราย)', 'นนทบุรี - เทศบาลเมืองปากเกร็ด', 'ปทุมธานี - เมืองปทุมธานี', 'ปทุมธานี - คลองหลวง', 'ปทุมธานี - ธัญบุรี', 'ปทุมธานี - หนองเสือ', 'ปทุมธานี - ลาดหลุมแก้ว', 'ปทุมธานี - ลำลูกกา', 'ปทุมธานี - สามโคก', 'ปทุมธานี - ลำลูกกา (สาขาตำบลคูคต)', 'พระนครศรีอยุธยา - พระนครศรีอยุธยา', 'พระนครศรีอยุธยา - ท่าเรือ', 'พระนครศรีอยุธยา - นครหลวง', 'พระนครศรีอยุธยา - บางไทร', 'พระนครศรีอยุธยา - บางบาล', 'พระนครศรีอยุธยา - บางปะอิน', 'พระนครศรีอยุธยา - บางปะหัน', 'พระนครศรีอยุธยา - ผักไห่', 'พระนครศรีอยุธยา - ภาชี', 'พระนครศรีอยุธยา - ลาดบัวหลวง', 'พระนครศรีอยุธยา - วังน้อย', 'พระนครศรีอยุธยา - เสนา', 'พระนครศรีอยุธยา - บางซ้าย', 'พระนครศรีอยุธยา - อุทัย', 'พระนครศรีอยุธยา - มหาราช', 'พระนครศรีอยุธยา - บ้านแพรก', 'อ่างทอง - เมืองอ่างทอง', 'อ่างทอง - ไชโย', 'อ่างทอง - ป่าโมก', 'อ่างทอง - โพธิ์ทอง', 'อ่างทอง - แสวงหา', 'อ่างทอง - วิเศษชัยชาญ', 'อ่างทอง - สามโก้', 'ลพบุรี - เมืองลพบุรี', 'ลพบุรี - พัฒนานิคม', 'ลพบุรี - โคกสำโรง', 'ลพบุรี - ชัยบาดาล', 'ลพบุรี - ท่าวุ้ง', 'ลพบุรี - บ้านหมี่', 'ลพบุรี - ท่าหลวง', 'ลพบุรี - สระโบสถ์', 'ลพบุรี - โคกเจริญ', 'ลพบุรี - ลำสนธิ', 'ลพบุรี - หนองม่วง', 'ลพบุรี - บ้านเช่า', 'สิงห์บุรี - เมืองสิงห์บุรี', 'สิงห์บุรี - บางระจัน', 'สิงห์บุรี - ค่ายบางระจัน', 'สิงห์บุรี - พรหมบุรี', 'สิงห์บุรี - ท่าช้าง', 'สิงห์บุรี - อินทร์บุรี', 'ชัยนาท - เมืองชัยนาท', 'ชัยนาท - มโนรมย์', 'ชัยนาท - วัดสิงห์', 'ชัยนาท - สรรพยา', 'ชัยนาท - สรรคบุรี', 'ชัยนาท - หันคา', 'ชัยนาท - หนองมะโมง', 'ชัยนาท - เนินขาม', 'สระบุรี - เมืองสระบุรี', 'สระบุรี - แก่งคอย', 'สระบุรี - หนองแค', 'สระบุรี - วิหารแดง', 'สระบุรี - หนองแซง', 'สระบุรี - บ้านหมอ', 'สระบุรี - ดอนพุด', 'สระบุรี - หนองโดน', 'สระบุรี - พระพุทธบาท', 'สระบุรี - เสาไห้', 'สระบุรี - มวกเหล็ก', 'สระบุรี - วังม่วง', 'สระบุรี - เฉลิมพระเกียรติ', 'ชลบุรี - เมืองชลบุรี', 'ชลบุรี - บ้านบึง', 'ชลบุรี - หนองใหญ่', 'ชลบุรี - บางละมุง', 'ชลบุรี - พานทอง', 'ชลบุรี - พนัสนิคม', 'ชลบุรี - ศรีราชา', 'ชลบุรี - เกาะสีชัง', 'ชลบุรี - สัตหีบ', 'ชลบุรี - บ่อทอง', 'ชลบุรี - เกาะจันทร์', 'ชลบุรี - สัตหีบ (สาขาตำบลบางเสร่)', 'ชลบุรี - ท้องถิ่นเทศบาลเมืองหนองปรือ', 'ชลบุรี - เทศบาลตำบลแหลมฉบัง', 'ชลบุรี - เทศบาลเมืองชลบุรี', 'ระยอง - เมืองระยอง', 'ระยอง - บ้านฉาง', 'ระยอง - แกลง', 'ระยอง - วังจันทร์', 'ระยอง - บ้านค่าย', 'ระยอง - ปลวกแดง', 'ระยอง - เขาชะเมา', 'ระยอง - นิคมพัฒนา', 'ระยอง - สาขาตำบลมาบข่า', 'จันทบุรี - เมืองจันทบุรี', 'จันทบุรี - ขลุง', 'จันทบุรี - ท่าใหม่', 'จันทบุรี - โป่งน้ำร้อน', 'จันทบุรี - มะขาม', 'จันทบุรี - แหลมสิงห์', 'จันทบุรี - สอยดาว', 'จันทบุรี - แก่งหางแมว', 'จันทบุรี - นายายอาม', 'จันทบุรี - เขาคิชฌกูฏ', 'จันทบุรี - กิ่งอำเภอกำพุธ', 'ตราด - เมืองตราด', 'ตราด - คลองใหญ่', 'ตราด - เขาสมิง', 'ตราด - บ่อไร่', 'ตราด - แหลมงอบ', 'ตราด - เกาะกูด', 'ตราด - เกาะช้าง', 'ฉะเชิงเทรา - เมืองฉะเชิงเทรา', 'ฉะเชิงเทรา - บางคล้า', 'ฉะเชิงเทรา - บางน้ำเปรี้ยว', 'ฉะเชิงเทรา - บางปะกง', 'ฉะเชิงเทรา - บ้านโพธิ์', 'ฉะเชิงเทรา - พนมสารคาม', 'ฉะเชิงเทรา - ราชสาส์น', 'ฉะเชิงเทรา - สนามชัยเขต', 'ฉะเชิงเทรา - แปลงยาว', 'ฉะเชิงเทรา - ท่าตะเกียบ', 'ฉะเชิงเทรา - คลองเขื่อน', 'ปราจีนบุรี - เมืองปราจีนบุรี', 'ปราจีนบุรี - กบินทร์บุรี', 'ปราจีนบุรี - นาดี', 'ปราจีนบุรี - สระแก้ว', 'ปราจีนบุรี - วังน้ำเย็น', 'ปราจีนบุรี - บ้านสร้าง', 'ปราจีนบุรี - ประจันตคาม', 'ปราจีนบุรี - ศรีมหาโพธิ', 'ปราจีนบุรี - ศรีมโหสถ', 'ปราจีนบุรี - อรัญประเทศ', 'ปราจีนบุรี - ตาพระยา', 'ปราจีนบุรี - วัฒนานคร', 'ปราจีนบุรี - คลองหาด', 'นครนายก - เมืองนครนายก', 'นครนายก - ปากพลี', 'นครนายก - บ้านนา', 'นครนายก - องครักษ์', 'สระแก้ว - เมืองสระแก้ว', 'สระแก้ว - คลองหาด', 'สระแก้ว - ตาพระยา', 'สระแก้ว - วังน้ำเย็น', 'สระแก้ว - วัฒนานคร', 'สระแก้ว - อรัญประเทศ', 'สระแก้ว - เขาฉกรรจ์', 'สระแก้ว - โคกสูง', 'สระแก้ว - วังสมบูรณ์', 'นครราชสีมา - เมืองนครราชสีมา', 'นครราชสีมา - ครบุรี', 'นครราชสีมา - เสิงสาง', 'นครราชสีมา - คง', 'นครราชสีมา - บ้านเหลื่อม', 'นครราชสีมา - จักราช', 'นครราชสีมา - โชคชัย', 'นครราชสีมา - ด่านขุนทด', 'นครราชสีมา - โนนไทย', 'นครราชสีมา - โนนสูง', 'นครราชสีมา - ขามสะแกแสง', 'นครราชสีมา - บัวใหญ่', 'นครราชสีมา - ประทาย', 'นครราชสีมา - ปักธงชัย', 'นครราชสีมา - พิมาย', 'นครราชสีมา - ห้วยแถลง', 'นครราชสีมา - ชุมพวง', 'นครราชสีมา - สูงเนิน', 'นครราชสีมา - ขามทะเลสอ', 'นครราชสีมา - สีคิ้ว', 'นครราชสีมา - ปากช่อง', 'นครราชสีมา - หนองบุญมาก', 'นครราชสีมา - แก้งสนามนาง', 'นครราชสีมา - โนนแดง', 'นครราชสีมา - วังน้ำเขียว', 'นครราชสีมา - เทพารักษ์', 'นครราชสีมา - เมืองยาง', 'นครราชสีมา - พระทองคำ', 'นครราชสีมา - ลำทะเมนชัย', 'นครราชสีมา - บัวลาย', 'นครราชสีมา - สีดา', 'นครราชสีมา - เฉลิมพระเกียรติ', 'นครราชสีมา - ท้องถิ่นเทศบาลตำบลโพธิ์กลาง', 'นครราชสีมา - สาขาตำบลมะค่า-พลสงคราม', 'นครราชสีมา - โนนลาว', 'บุรีรัมย์ - เมืองบุรีรัมย์', 'บุรีรัมย์ - คูเมือง', 'บุรีรัมย์ - กระสัง', 'บุรีรัมย์ - นางรอง', 'บุรีรัมย์ - หนองกี่', 'บุรีรัมย์ - ละหานทราย', 'บุรีรัมย์ - ประโคนชัย', 'บุรีรัมย์ - บ้านกรวด', 'บุรีรัมย์ - พุทไธสง', 'บุรีรัมย์ - ลำปลายมาศ', 'บุรีรัมย์ - สตึก', 'บุรีรัมย์ - ปะคำ', 'บุรีรัมย์ - นาโพธิ์', 'บุรีรัมย์ - หนองหงส์', 'บุรีรัมย์ - พลับพลาชัย', 'บุรีรัมย์ - ห้วยราช', 'บุรีรัมย์ - โนนสุวรรณ', 'บุรีรัมย์ - ชำนิ', 'บุรีรัมย์ - บ้านใหม่ไชยพจน์', 'บุรีรัมย์ - โนนดินแดง', 'บุรีรัมย์ - บ้านด่าน', 'บุรีรัมย์ - แคนดง', 'บุรีรัมย์ - เฉลิมพระเกียรติ', 'สุรินทร์ - เมืองสุรินทร์', 'สุรินทร์ - ชุมพลบุรี', 'สุรินทร์ - ท่าตูม', 'สุรินทร์ - จอมพระ', 'สุรินทร์ - ปราสาท', 'สุรินทร์ - กาบเชิง', 'สุรินทร์ - รัตนบุรี', 'สุรินทร์ - สนม', 'สุรินทร์ - ศีขรภูมิ', 'สุรินทร์ - สังขะ', 'สุรินทร์ - ลำดวน', 'สุรินทร์ - สำโรงทาบ', 'สุรินทร์ - บัวเชด', 'สุรินทร์ - พนมดงรัก', 'สุรินทร์ - ศรีณรงค์', 'สุรินทร์ - เขวาสินรินทร์', 'สุรินทร์ - โนนนารายณ์', 'ศรีสะเกษ - เมืองศรีสะเกษ', 'ศรีสะเกษ - ยางชุมน้อย', 'ศรีสะเกษ - กันทรารมย์', 'ศรีสะเกษ - กันทรลักษ์', 'ศรีสะเกษ - ขุขันธ์', 'ศรีสะเกษ - ไพรบึง', 'ศรีสะเกษ - ปรางค์กู่', 'ศรีสะเกษ - ขุนหาญ', 'ศรีสะเกษ - ราษีไศล', 'ศรีสะเกษ - อุทุมพรพิสัย', 'ศรีสะเกษ - บึงบูรพ์', 'ศรีสะเกษ - ห้วยทับทัน', 'ศรีสะเกษ - โนนคูณ', 'ศรีสะเกษ - ศรีรัตนะ', 'ศรีสะเกษ - น้ำเกลี้ยง', 'ศรีสะเกษ - วังหิน', 'ศรีสะเกษ - ภูสิงห์', 'ศรีสะเกษ - เมืองจันทร์', 'ศรีสะเกษ - เบญจลักษ์', 'ศรีสะเกษ - พยุห์', 'ศรีสะเกษ - โพธิ์ศรีสุวรรณ', 'ศรีสะเกษ - ศิลาลาด', 'อุบลราชธานี - เมืองอุบลราชธานี', 'อุบลราชธานี - ศรีเมืองใหม่', 'อุบลราชธานี - โขงเจียม', 'อุบลราชธานี - เขื่องใน', 'อุบลราชธานี - เขมราฐ', 'อุบลราชธานี - ชานุมาน', 'อุบลราชธานี - เดชอุดม', 'อุบลราชธานี - นาจะหลวย', 'อุบลราชธานี - น้ำยืน', 'อุบลราชธานี - บุณฑริก', 'อุบลราชธานี - ตระการพืชผล', 'อุบลราชธานี - กุดข้าวปุ้น', 'อุบลราชธานี - พนา', 'อุบลราชธานี - ม่วงสามสิบ', 'อุบลราชธานี - วารินชำราบ', 'อุบลราชธานี - อำนาจเจริญ', 'อุบลราชธานี - เสนางคนิคม', 'อุบลราชธานี - หัวตะพาน', 'อุบลราชธานี - พิบูลมังสาหาร', 'อุบลราชธานี - ตาลสุม', 'อุบลราชธานี - โพธิ์ไทร', 'อุบลราชธานี - สำโรง', 'อุบลราชธานี - กิ่งอำเภอลืออำนาจ', 'อุบลราชธานี - ดอนมดแดง', 'อุบลราชธานี - สิรินธร', 'อุบลราชธานี - ทุ่งศรีอุดม', 'อุบลราชธานี - ปทุมราชวงศา', 'อุบลราชธานี - กิ่งอำเภอศรีหลักชัย', 'อุบลราชธานี - นาเยีย', 'อุบลราชธานี - นาตาล', 'อุบลราชธานี - เหล่าเสือโก้ก', 'อุบลราชธานี - สว่างวีระวงศ์', 'อุบลราชธานี - น้ำขุ่น', 'อุบลราชธานี - สุวรรณวารี', 'ยโสธร - เมืองยโสธร', 'ยโสธร - ทรายมูล', 'ยโสธร - กุดชุม', 'ยโสธร - คำเขื่อนแก้ว', 'ยโสธร - ป่าติ้ว', 'ยโสธร - มหาชนะชัย', 'ยโสธร - ค้อวัง', 'ยโสธร - เลิงนกทา', 'ยโสธร - ไทยเจริญ', 'ชัยภูมิ - เมืองชัยภูมิ', 'ชัยภูมิ - บ้านเขว้า', 'ชัยภูมิ - คอนสวรรค์', 'ชัยภูมิ - เกษตรสมบูรณ์', 'ชัยภูมิ - หนองบัวแดง', 'ชัยภูมิ - จัตุรัส', 'ชัยภูมิ - บำเหน็จณรงค์', 'ชัยภูมิ - หนองบัวระเหว', 'ชัยภูมิ - เทพสถิต', 'ชัยภูมิ - ภูเขียว', 'ชัยภูมิ - บ้านแท่น', 'ชัยภูมิ - แก้งคร้อ', 'ชัยภูมิ - คอนสาร', 'ชัยภูมิ - ภักดีชุมพล', 'ชัยภูมิ - เนินสง่า', 'ชัยภูมิ - ซับใหญ่', 'ชัยภูมิ - เมืองชัยภูมิ (สาขาตำบลโนนสำราญ)', 'ชัยภูมิ - สาขาตำบลบ้านหว่าเฒ่า', 'ชัยภูมิ - หนองบัวแดง (สาขาตำบลวังชมภู)', 'ชัยภูมิ - กิ่งอำเภอซับใหญ่ (สาขาตำบลซับใหญ่)', 'ชัยภูมิ - สาขาตำบลโคกเพชร', 'ชัยภูมิ - เทพสถิต (สาขาตำบลนายางกลัก)', 'ชัยภูมิ - บ้านแท่น (สาขาตำบลบ้านเต่า)', 'ชัยภูมิ - แก้งคร้อ (สาขาตำบลท่ามะไฟหวาน)', 'ชัยภูมิ - คอนสาร (สาขาตำบลโนนคูณ)', 'อำนาจเจริญ - เมืองอำนาจเจริญ', 'อำนาจเจริญ - ชานุมาน', 'อำนาจเจริญ - ปทุมราชวงศา', 'อำนาจเจริญ - พนา', 'อำนาจเจริญ - เสนางคนิคม', 'อำนาจเจริญ - หัวตะพาน', 'อำนาจเจริญ - ลืออำนาจ', 'บึงกาฬ - เมืองบึงกาฬ', 'บึงกาฬ - เซกา', 'บึงกาฬ - โซ่พิสัย', 'บึงกาฬ - พรเจริญ', 'บึงกาฬ - ศรีวิไล', 'บึงกาฬ - บึงโขงหลง', 'บึงกาฬ - ปากคาด', 'บึงกาฬ - บุ่งคล้า', 'หนองบัวลำภู - เมืองหนองบัวลำภู', 'หนองบัวลำภู - นากลาง', 'หนองบัวลำภู - โนนสัง', 'หนองบัวลำภู - ศรีบุญเรือง', 'หนองบัวลำภู - สุวรรณคูหา', 'หนองบัวลำภู - นาวัง', 'ขอนแก่น - เมืองขอนแก่น', 'ขอนแก่น - บ้านฝาง', 'ขอนแก่น - พระยืน', 'ขอนแก่น - หนองเรือ', 'ขอนแก่น - ชุมแพ', 'ขอนแก่น - สีชมพู', 'ขอนแก่น - น้ำพอง', 'ขอนแก่น - อุบลรัตน์', 'ขอนแก่น - กระนวน', 'ขอนแก่น - บ้านไผ่', 'ขอนแก่น - เปือยน้อย', 'ขอนแก่น - พล', 'ขอนแก่น - แวงใหญ่', 'ขอนแก่น - แวงน้อย', 'ขอนแก่น - หนองสองห้อง', 'ขอนแก่น - ภูเวียง', 'ขอนแก่น - มัญจาคีรี', 'ขอนแก่น - ชนบท', 'ขอนแก่น - เขาสวนกวาง', 'ขอนแก่น - ภูผาม่าน', 'ขอนแก่น - ซำสูง', 'ขอนแก่น - โคกโพธิ์ไชย', 'ขอนแก่น - หนองนาคำ', 'ขอนแก่น - บ้านแฮด', 'ขอนแก่น - โนนศิลา', 'ขอนแก่น - เวียงเก่า', 'ขอนแก่น - ท้องถิ่นเทศบาลตำบลบ้านเป็ด', 'ขอนแก่น - เทศบาลตำบลเมืองพล', 'อุดรธานี - เมืองอุดรธานี', 'อุดรธานี - กุดจับ', 'อุดรธานี - หนองวัวซอ', 'อุดรธานี - กุมภวาปี', 'อุดรธานี - โนนสะอาด', 'อุดรธานี - หนองหาน', 'อุดรธานี - ทุ่งฝน', 'อุดรธานี - ไชยวาน', 'อุดรธานี - ศรีธาตุ', 'อุดรธานี - วังสามหมอ', 'อุดรธานี - บ้านดุง', 'อุดรธานี - หนองบัวลำภู', 'อุดรธานี - ศรีบุญเรือง', 'อุดรธานี - นากลาง', 'อุดรธานี - สุวรรณคูหา', 'อุดรธานี - โนนสัง', 'อุดรธานี - บ้านผือ', 'อุดรธานี - น้ำโสม', 'อุดรธานี - เพ็ญ', 'อุดรธานี - สร้างคอม', 'อุดรธานี - หนองแสง', 'อุดรธานี - นายูง', 'อุดรธานี - พิบูลย์รักษ์', 'อุดรธานี - กู่แก้ว', 'อุดรธานี - ประจักษ์ศิลปาคม', 'เลย - เมืองเลย', 'เลย - นาด้วง', 'เลย - เชียงคาน', 'เลย - ปากชม', 'เลย - ด่านซ้าย', 'เลย - นาแห้ว', 'เลย - ภูเรือ', 'เลย - ท่าลี่', 'เลย - วังสะพุง', 'เลย - ภูกระดึง', 'เลย - ภูหลวง', 'เลย - ผาขาว', 'เลย - เอราวัณ', 'เลย - หนองหิน', 'หนองคาย - เมืองหนองคาย', 'หนองคาย - ท่าบ่อ', '- เมืองบึงกาฬ', '- พรเจริญ', 'หนองคาย - โพนพิสัย', '- โซ่พิสัย', 'หนองคาย - ศรีเชียงใหม่', 'หนองคาย - สังคม', '- เซกา', '- ปากคาด', '- บึงโขงหลง', '- ศรีวิไล', '- บุ่งคล้า', 'หนองคาย - สระใคร', 'หนองคาย - เฝ้าไร่', 'หนองคาย - รัตนวาปี', 'หนองคาย - โพธิ์ตาก', 'มหาสารคาม - เมืองมหาสารคาม', 'มหาสารคาม - แกดำ', 'มหาสารคาม - โกสุมพิสัย', 'มหาสารคาม - กันทรวิชัย', 'มหาสารคาม - เชียงยืน', 'มหาสารคาม - บรบือ', 'มหาสารคาม - นาเชือก', 'มหาสารคาม - พยัคฆภูมิพิสัย', 'มหาสารคาม - วาปีปทุม', 'มหาสารคาม - นาดูน', 'มหาสารคาม - ยางสีสุราช', 'มหาสารคาม - กุดรัง', 'มหาสารคาม - ชื่นชม', 'มหาสารคาม - หลุบ', 'ร้อยเอ็ด - เมืองร้อยเอ็ด', 'ร้อยเอ็ด - เกษตรวิสัย', 'ร้อยเอ็ด - ปทุมรัตต์', 'ร้อยเอ็ด - จตุรพักตรพิมาน', 'ร้อยเอ็ด - ธวัชบุรี', 'ร้อยเอ็ด - พนมไพร', 'ร้อยเอ็ด - โพนทอง', 'ร้อยเอ็ด - โพธิ์ชัย', 'ร้อยเอ็ด - หนองพอก', 'ร้อยเอ็ด - เสลภูมิ', 'ร้อยเอ็ด - สุวรรณภูมิ', 'ร้อยเอ็ด - เมืองสรวง', 'ร้อยเอ็ด - โพนทราย', 'ร้อยเอ็ด - อาจสามารถ', 'ร้อยเอ็ด - เมยวดี', 'ร้อยเอ็ด - ศรีสมเด็จ', 'ร้อยเอ็ด - จังหาร', 'ร้อยเอ็ด - เชียงขวัญ', 'ร้อยเอ็ด - หนองฮี', 'ร้อยเอ็ด - ทุ่งเขาหลวง', 'กาฬสินธุ์ - เมืองกาฬสินธุ์', 'กาฬสินธุ์ - นามน', 'กาฬสินธุ์ - กมลาไสย', 'กาฬสินธุ์ - ร่องคำ', 'กาฬสินธุ์ - กุฉินารายณ์', 'กาฬสินธุ์ - เขาวง', 'กาฬสินธุ์ - ยางตลาด', 'กาฬสินธุ์ - ห้วยเม็ก', 'กาฬสินธุ์ - สหัสขันธ์', 'กาฬสินธุ์ - คำม่วง', 'กาฬสินธุ์ - ท่าคันโท', 'กาฬสินธุ์ - หนองกุงศรี', 'กาฬสินธุ์ - สมเด็จ', 'กาฬสินธุ์ - ห้วยผึ้ง', 'กาฬสินธุ์ - สามชัย', 'กาฬสินธุ์ - นาคู', 'กาฬสินธุ์ - ดอนจาน', 'กาฬสินธุ์ - ฆ้องชัย', 'สกลนคร - เมืองสกลนคร', 'สกลนคร - กุสุมาลย์', 'สกลนคร - กุดบาก', 'สกลนคร - พรรณานิคม', 'สกลนคร - พังโคน', 'สกลนคร - วาริชภูมิ', 'สกลนคร - นิคมน้ำอูน', 'สกลนคร - วานรนิวาส', 'สกลนคร - คำตากล้า', 'สกลนคร - บ้านม่วง', 'สกลนคร - อากาศอำนวย', 'สกลนคร - สว่างแดนดิน', 'สกลนคร - ส่องดาว', 'สกลนคร - เต่างอย', 'สกลนคร - โคกศรีสุพรรณ', 'สกลนคร - เจริญศิลป์', 'สกลนคร - โพนนาแก้ว', 'สกลนคร - ภูพาน', 'สกลนคร - วานรนิวาส', 'สกลนคร - บ้านหัน', 'นครพนม - เมืองนครพนม', 'นครพนม - ปลาปาก', 'นครพนม - ท่าอุเทน', 'นครพนม - บ้านแพง', 'นครพนม - ธาตุพนม', 'นครพนม - เรณูนคร', 'นครพนม - นาแก', 'นครพนม - ศรีสงคราม', 'นครพนม - นาหว้า', 'นครพนม - โพนสวรรค์', 'นครพนม - นาทม', 'นครพนม - วังยาง', 'มุกดาหาร - เมืองมุกดาหาร', 'มุกดาหาร - นิคมคำสร้อย', 'มุกดาหาร - ดอนตาล', 'มุกดาหาร - ดงหลวง', 'มุกดาหาร - คำชะอี', 'มุกดาหาร - หว้านใหญ่', 'มุกดาหาร - หนองสูง', 'เชียงใหม่ - เมืองเชียงใหม่', 'เชียงใหม่ - จอมทอง', 'เชียงใหม่ - แม่แจ่ม', 'เชียงใหม่ - เชียงดาว', 'เชียงใหม่ - ดอยสะเก็ด', 'เชียงใหม่ - แม่แตง', 'เชียงใหม่ - แม่ริม', 'เชียงใหม่ - สะเมิง', 'เชียงใหม่ - ฝาง', 'เชียงใหม่ - แม่อาย', 'เชียงใหม่ - พร้าว', 'เชียงใหม่ - สันป่าตอง', 'เชียงใหม่ - สันกำแพง', 'เชียงใหม่ - สันทราย', 'เชียงใหม่ - หางดง', 'เชียงใหม่ - ฮอด', 'เชียงใหม่ - ดอยเต่า', 'เชียงใหม่ - อมก๋อย', 'เชียงใหม่ - สารภี', 'เชียงใหม่ - เวียงแหง', 'เชียงใหม่ - ไชยปราการ', 'เชียงใหม่ - แม่วาง', 'เชียงใหม่ - แม่ออน', 'เชียงใหม่ - ดอยหล่อ', 'เชียงใหม่ - เทศบาลนครเชียงใหม่ (สาขาแขวงกาลวิละ)', 'เชียงใหม่ - เทศบาลนครเชียงใหม่ (สาขาแขวงศรีวิชั)', 'เชียงใหม่ - เทศบาลนครเชียงใหม่ (สาขาเม็งราย)', 'ลำพูน - เมืองลำพูน', 'ลำพูน - แม่ทา', 'ลำพูน - บ้านโฮ่ง', 'ลำพูน - ลี้', 'ลำพูน - ทุ่งหัวช้าง', 'ลำพูน - ป่าซาง', 'ลำพูน - บ้านธิ', 'ลำพูน - เวียงหนองล่อง', 'ลำปาง - เมืองลำปาง', 'ลำปาง - แม่เมาะ', 'ลำปาง - เกาะคา', 'ลำปาง - เสริมงาม', 'ลำปาง - งาว', 'ลำปาง - แจ้ห่ม', 'ลำปาง - วังเหนือ', 'ลำปาง - เถิน', 'ลำปาง - แม่พริก', 'ลำปาง - แม่ทะ', 'ลำปาง - สบปราบ', 'ลำปาง - ห้างฉัตร', 'ลำปาง - เมืองปาน', 'อุตรดิตถ์ - เมืองอุตรดิตถ์', 'อุตรดิตถ์ - ตรอน', 'อุตรดิตถ์ - ท่าปลา', 'อุตรดิตถ์ - น้ำปาด', 'อุตรดิตถ์ - ฟากท่า', 'อุตรดิตถ์ - บ้านโคก', 'อุตรดิตถ์ - พิชัย', 'อุตรดิตถ์ - ลับแล', 'อุตรดิตถ์ - ทองแสนขัน', 'แพร่ - เมืองแพร่', 'แพร่ - ร้องกวาง', 'แพร่ - ลอง', 'แพร่ - สูงเม่น', 'แพร่ - เด่นชัย', 'แพร่ - สอง', 'แพร่ - วังชิ้น', 'แพร่ - หนองม่วงไข่', 'น่าน - เมืองน่าน', 'น่าน - แม่จริม', 'น่าน - บ้านหลวง', 'น่าน - นาน้อย', 'น่าน - ปัว', 'น่าน - ท่าวังผา', 'น่าน - เวียงสา', 'น่าน - ทุ่งช้าง', 'น่าน - เชียงกลาง', 'น่าน - นาหมื่น', 'น่าน - สันติสุข', 'น่าน - บ่อเกลือ', 'น่าน - สองแคว', 'น่าน - ภูเพียง', 'น่าน - เฉลิมพระเกียรติ', 'พะเยา - เมืองพะเยา', 'พะเยา - จุน', 'พะเยา - เชียงคำ', 'พะเยา - เชียงม่วน', 'พะเยา - ดอกคำใต้', 'พะเยา - ปง', 'พะเยา - แม่ใจ', 'พะเยา - ภูซาง', 'พะเยา - ภูกามยาว', 'เชียงราย - เมืองเชียงราย', 'เชียงราย - เวียงชัย', 'เชียงราย - เชียงของ', 'เชียงราย - เทิง', 'เชียงราย - พาน', 'เชียงราย - ป่าแดด', 'เชียงราย - แม่จัน', 'เชียงราย - เชียงแสน', 'เชียงราย - แม่สาย', 'เชียงราย - แม่สรวย', 'เชียงราย - เวียงป่าเป้า', 'เชียงราย - พญาเม็งราย', 'เชียงราย - เวียงแก่น', 'เชียงราย - ขุนตาล', 'เชียงราย - แม่ฟ้าหลวง', 'เชียงราย - แม่ลาว', 'เชียงราย - เวียงเชียงรุ้ง', 'เชียงราย - ดอยหลวง', 'แม่ฮ่องสอน - เมืองแม่ฮ่องสอน', 'แม่ฮ่องสอน - ขุนยวม', 'แม่ฮ่องสอน - ปาย', 'แม่ฮ่องสอน - แม่สะเรียง', 'แม่ฮ่องสอน - แม่ลาน้อย', 'แม่ฮ่องสอน - สบเมย', 'แม่ฮ่องสอน - ปางมะผ้า', 'แม่ฮ่องสอน - ม่วยต่อ', 'นครสวรรค์ - เมืองนครสวรรค์', 'นครสวรรค์ - โกรกพระ', 'นครสวรรค์ - ชุมแสง', 'นครสวรรค์ - หนองบัว', 'นครสวรรค์ - บรรพตพิสัย', 'นครสวรรค์ - เก้าเลี้ยว', 'นครสวรรค์ - ตาคลี', 'นครสวรรค์ - ท่าตะโก', 'นครสวรรค์ - ไพศาลี', 'นครสวรรค์ - พยุหะคีรี', 'นครสวรรค์ - ลาดยาว', 'นครสวรรค์ - ตากฟ้า', 'นครสวรรค์ - แม่วงก์', 'นครสวรรค์ - แม่เปิน', 'นครสวรรค์ - ชุมตาบง', 'นครสวรรค์ - สาขาตำบลห้วยน้ำหอม', 'นครสวรรค์ - กิ่งอำเภอชุมตาบง (สาขาตำบลชุมตาบง)', 'นครสวรรค์ - แม่วงก์ (สาขาตำบลแม่เล่ย์)', 'อุทัยธานี - เมืองอุทัยธานี', 'อุทัยธานี - ทัพทัน', 'อุทัยธานี - สว่างอารมณ์', 'อุทัยธานี - หนองฉาง', 'อุทัยธานี - หนองขาหย่าง', 'อุทัยธานี - บ้านไร่', 'อุทัยธานี - ลานสัก', 'อุทัยธานี - ห้วยคต', 'กำแพงเพชร - เมืองกำแพงเพชร', 'กำแพงเพชร - ไทรงาม', 'กำแพงเพชร - คลองลาน', 'กำแพงเพชร - ขาณุวรลักษบุรี', 'กำแพงเพชร - คลองขลุง', 'กำแพงเพชร - พรานกระต่าย', 'กำแพงเพชร - ลานกระบือ', 'กำแพงเพชร - ทรายทองวัฒนา', 'กำแพงเพชร - ปางศิลาทอง', 'กำแพงเพชร - บึงสามัคคี', 'กำแพงเพชร - โกสัมพีนคร', 'ตาก - เมืองตาก', 'ตาก - บ้านตาก', 'ตาก - สามเงา', 'ตาก - แม่ระมาด', 'ตาก - ท่าสองยาง', 'ตาก - แม่สอด', 'ตาก - พบพระ', 'ตาก - อุ้มผาง', 'ตาก - วังเจ้า', 'ตาก - กิ่งอำเภอท่าปุย', 'สุโขทัย - เมืองสุโขทัย', 'สุโขทัย - บ้านด่านลานหอย', 'สุโขทัย - คีรีมาศ', 'สุโขทัย - กงไกรลาศ', 'สุโขทัย - ศรีสัชนาลัย', 'สุโขทัย - ศรีสำโรง', 'สุโขทัย - สวรรคโลก', 'สุโขทัย - ศรีนคร', 'สุโขทัย - ทุ่งเสลี่ยม', 'พิษณุโลก - เมืองพิษณุโลก', 'พิษณุโลก - นครไทย', 'พิษณุโลก - ชาติตระการ', 'พิษณุโลก - บางระกำ', 'พิษณุโลก - บางกระทุ่ม', 'พิษณุโลก - พรหมพิราม', 'พิษณุโลก - วัดโบสถ์', 'พิษณุโลก - วังทอง', 'พิษณุโลก - เนินมะปราง', 'พิจิตร - เมืองพิจิตร', 'พิจิตร - วังทรายพูน', 'พิจิตร - โพธิ์ประทับช้าง', 'พิจิตร - ตะพานหิน', 'พิจิตร - บางมูลนาก', 'พิจิตร - โพทะเล', 'พิจิตร - สามง่าม', 'พิจิตร - ทับคล้อ', 'พิจิตร - สากเหล็ก', 'พิจิตร - บึงนาราง', 'พิจิตร - ดงเจริญ', 'พิจิตร - วชิรบารมี', 'เพชรบูรณ์ - เมืองเพชรบูรณ์', 'เพชรบูรณ์ - ชนแดน', 'เพชรบูรณ์ - หล่มสัก', 'เพชรบูรณ์ - หล่มเก่า', 'เพชรบูรณ์ - วิเชียรบุรี', 'เพชรบูรณ์ - ศรีเทพ', 'เพชรบูรณ์ - หนองไผ่', 'เพชรบูรณ์ - บึงสามพัน', 'เพชรบูรณ์ - น้ำหนาว', 'เพชรบูรณ์ - วังโป่ง', 'เพชรบูรณ์ - เขาค้อ', 'ราชบุรี - เมืองราชบุรี', 'ราชบุรี - จอมบึง', 'ราชบุรี - สวนผึ้ง', 'ราชบุรี - ดำเนินสะดวก', 'ราชบุรี - บ้านโป่ง', 'ราชบุรี - บางแพ', 'ราชบุรี - โพธาราม', 'ราชบุรี - ปากท่อ', 'ราชบุรี - วัดเพลง', 'ราชบุรี - บ้านคา', 'ราชบุรี - ท้องถิ่นเทศบาลตำบลบ้านฆ้อง', 'กาญจนบุรี - เมืองกาญจนบุรี', 'กาญจนบุรี - ไทรโยค', 'กาญจนบุรี - บ่อพลอย', 'กาญจนบุรี - ศรีสวัสดิ์', 'กาญจนบุรี - ท่ามะกา', 'กาญจนบุรี - ท่าม่วง', 'กาญจนบุรี - ทองผาภูมิ', 'กาญจนบุรี - สังขละบุรี', 'กาญจนบุรี - พนมทวน', 'กาญจนบุรี - เลาขวัญ', 'กาญจนบุรี - ด่านมะขามเตี้ย', 'กาญจนบุรี - หนองปรือ', 'กาญจนบุรี - ห้วยกระเจา', 'กาญจนบุรี - สาขาตำบลท่ากระดาน', 'กาญจนบุรี - บ้านทวน', 'สุพรรณบุรี - เมืองสุพรรณบุรี', 'สุพรรณบุรี - เดิมบางนางบวช', 'สุพรรณบุรี - ด่านช้าง', 'สุพรรณบุรี - บางปลาม้า', 'สุพรรณบุรี - ศรีประจันต์', 'สุพรรณบุรี - ดอนเจดีย์', 'สุพรรณบุรี - สองพี่น้อง', 'สุพรรณบุรี - สามชุก', 'สุพรรณบุรี - อู่ทอง', 'สุพรรณบุรี - หนองหญ้าไซ', 'นครปฐม - เมืองนครปฐม', 'นครปฐม - กำแพงแสน', 'นครปฐม - นครชัยศรี', 'นครปฐม - ดอนตูม', 'นครปฐม - บางเลน', 'นครปฐม - สามพราน', 'นครปฐม - พุทธมณฑล', 'สมุทรสาคร - เมืองสมุทรสาคร', 'สมุทรสาคร - กระทุ่มแบน', 'สมุทรสาคร - บ้านแพ้ว', 'สมุทรสงคราม - เมืองสมุทรสงคราม', 'สมุทรสงคราม - บางคนที', 'สมุทรสงคราม - อัมพวา', 'เพชรบุรี - เมืองเพชรบุรี', 'เพชรบุรี - เขาย้อย', 'เพชรบุรี - หนองหญ้าปล้อง', 'เพชรบุรี - ชะอำ', 'เพชรบุรี - ท่ายาง', 'เพชรบุรี - บ้านลาด', 'เพชรบุรี - บ้านแหลม', 'เพชรบุรี - แก่งกระจาน', 'ประจวบคีรีขันธ์ - เมืองประจวบคีรีขันธ์', 'ประจวบคีรีขันธ์ - กุยบุรี', 'ประจวบคีรีขันธ์ - ทับสะแก', 'ประจวบคีรีขันธ์ - บางสะพาน', 'ประจวบคีรีขันธ์ - บางสะพานน้อย', 'ประจวบคีรีขันธ์ - ปราณบุรี', 'ประจวบคีรีขันธ์ - หัวหิน', 'ประจวบคีรีขันธ์ - สามร้อยยอด', 'นครศรีธรรมราช - เมืองนครศรีธรรมราช', 'นครศรีธรรมราช - พรหมคีรี', 'นครศรีธรรมราช - ลานสกา', 'นครศรีธรรมราช - ฉวาง', 'นครศรีธรรมราช - พิปูน', 'นครศรีธรรมราช - เชียรใหญ่', 'นครศรีธรรมราช - ชะอวด', 'นครศรีธรรมราช - ท่าศาลา', 'นครศรีธรรมราช - ทุ่งสง', 'นครศรีธรรมราช - นาบอน', 'นครศรีธรรมราช - ทุ่งใหญ่', 'นครศรีธรรมราช - ปากพนัง', 'นครศรีธรรมราช - ร่อนพิบูลย์', 'นครศรีธรรมราช - สิชล', 'นครศรีธรรมราช - ขนอม', 'นครศรีธรรมราช - หัวไทร', 'นครศรีธรรมราช - บางขัน', 'นครศรีธรรมราช - ถ้ำพรรณรา', 'นครศรีธรรมราช - จุฬาภรณ์', 'นครศรีธรรมราช - พระพรหม', 'นครศรีธรรมราช - นบพิตำ', 'นครศรีธรรมราช - ช้างกลาง', 'นครศรีธรรมราช - เฉลิมพระเกียรติ', 'นครศรีธรรมราช - เชียรใหญ่ (สาขาตำบลเสือหึง)', 'นครศรีธรรมราช - สาขาตำบลสวนหลวง', 'นครศรีธรรมราช - ร่อนพิบูลย์ (สาขาตำบลหินตก)', 'นครศรีธรรมราช - หัวไทร (สาขาตำบลควนชะลิก)', 'นครศรีธรรมราช - ทุ่งสง (สาขาตำบลกะปาง)', 'กระบี่ - เมืองกระบี่', 'กระบี่ - เขาพนม', 'กระบี่ - เกาะลันตา', 'กระบี่ - คลองท่อม', 'กระบี่ - อ่าวลึก', 'กระบี่ - ปลายพระยา', 'กระบี่ - ลำทับ', 'กระบี่ - เหนือคลอง', 'พังงา - เมืองพังงา', 'พังงา - เกาะยาว', 'พังงา - กะปง', 'พังงา - ตะกั่วทุ่ง', 'พังงา - ตะกั่วป่า', 'พังงา - คุระบุรี', 'พังงา - ทับปุด', 'พังงา - ท้ายเหมือง', 'ภูเก็ต - เมืองภูเก็ต', 'ภูเก็ต - กะทู้', 'ภูเก็ต - ถลาง', 'ภูเก็ต - ทุ่งคา', 'สุราษฎร์ธานี - เมืองสุราษฎร์ธานี', 'สุราษฎร์ธานี - กาญจนดิษฐ์', 'สุราษฎร์ธานี - ดอนสัก', 'สุราษฎร์ธานี - เกาะสมุย', 'สุราษฎร์ธานี - เกาะพะงัน', 'สุราษฎร์ธานี - ไชยา', 'สุราษฎร์ธานี - ท่าชนะ', 'สุราษฎร์ธานี - คีรีรัฐนิคม', 'สุราษฎร์ธานี - บ้านตาขุน', 'สุราษฎร์ธานี - พนม', 'สุราษฎร์ธานี - ท่าฉาง', 'สุราษฎร์ธานี - บ้านนาสาร', 'สุราษฎร์ธานี - บ้านนาเดิม', 'สุราษฎร์ธานี - เคียนซา', 'สุราษฎร์ธานี - เวียงสระ', 'สุราษฎร์ธานี - พระแสง', 'สุราษฎร์ธานี - พุนพิน', 'สุราษฎร์ธานี - ชัยบุรี', 'สุราษฎร์ธานี - วิภาวดี', 'สุราษฎร์ธานี - เกาะพงัน', 'สุราษฎร์ธานี - บ้านดอน', 'ระนอง - เมืองระนอง', 'ระนอง - ละอุ่น', 'ระนอง - กะเปอร์', 'ระนอง - กระบุรี', 'ระนอง - สุขสำราญ', 'ชุมพร - เมืองชุมพร', 'ชุมพร - ท่าแซะ', 'ชุมพร - ปะทิว', 'ชุมพร - หลังสวน', 'ชุมพร - ละแม', 'ชุมพร - พะโต๊ะ', 'ชุมพร - สวี', 'ชุมพร - ทุ่งตะโก', 'สงขลา - เมืองสงขลา', 'สงขลา - สทิงพระ', 'สงขลา - จะนะ', 'สงขลา - นาทวี', 'สงขลา - เทพา', 'สงขลา - สะบ้าย้อย', 'สงขลา - ระโนด', 'สงขลา - กระแสสินธุ์', 'สงขลา - รัตภูมิ', 'สงขลา - สะเดา', 'สงขลา - หาดใหญ่', 'สงขลา - นาหม่อม', 'สงขลา - ควนเนียง', 'สงขลา - บางกล่ำ', 'สงขลา - สิงหนคร', 'สงขลา - คลองหอยโข่ง', 'สงขลา - ท้องถิ่นเทศบาลตำบลสำนักขาม', 'สงขลา - เทศบาลตำบลบ้านพรุ', 'สตูล - เมืองสตูล', 'สตูล - ควนโดน', 'สตูล - ควนกาหลง', 'สตูล - ท่าแพ', 'สตูล - ละงู', 'สตูล - ทุ่งหว้า', 'สตูล - มะนัง', 'ตรัง - เมืองตรัง', 'ตรัง - กันตัง', 'ตรัง - ย่านตาขาว', 'ตรัง - ปะเหลียน', 'ตรัง - สิเกา', 'ตรัง - ห้วยยอด', 'ตรัง - วังวิเศษ', 'ตรัง - นาโยง', 'ตรัง - รัษฎา', 'ตรัง - หาดสำราญ', 'ตรัง - อำเภอเมืองตรัง(สาขาคลองเต็ง)', 'พัทลุง - เมืองพัทลุง', 'พัทลุง - กงหรา', 'พัทลุง - เขาชัยสน', 'พัทลุง - ตะโหมด', 'พัทลุง - ควนขนุน', 'พัทลุง - ปากพะยูน', 'พัทลุง - ศรีบรรพต', 'พัทลุง - ป่าบอน', 'พัทลุง - บางแก้ว', 'พัทลุง - ป่าพะยอม', 'พัทลุง - ศรีนครินทร์', 'ปัตตานี - เมืองปัตตานี', 'ปัตตานี - โคกโพธิ์', 'ปัตตานี - หนองจิก', 'ปัตตานี - ปะนาเระ', 'ปัตตานี - มายอ', 'ปัตตานี - ทุ่งยางแดง', 'ปัตตานี - สายบุรี', 'ปัตตานี - ไม้แก่น', 'ปัตตานี - ยะหริ่ง', 'ปัตตานี - ยะรัง', 'ปัตตานี - กะพ้อ', 'ปัตตานี - แม่ลาน', 'ยะลา - เมืองยะลา', 'ยะลา - เบตง', 'ยะลา - บันนังสตา', 'ยะลา - ธารโต', 'ยะลา - ยะหา', 'ยะลา - รามัน', 'ยะลา - กาบัง', 'ยะลา - กรงปินัง', 'นราธิวาส - เมืองนราธิวาส', 'นราธิวาส - ตากใบ', 'นราธิวาส - บาเจาะ', 'นราธิวาส - ยี่งอ', 'นราธิวาส - ระแงะ', 'นราธิวาส - รือเสาะ', 'นราธิวาส - ศรีสาคร', 'นราธิวาส - แว้ง', 'นราธิวาส - สุคิริน', 'นราธิวาส - สุไหงโก-ลก', 'นราธิวาส - สุไหงปาดี', 'นราธิวาส - จะแนะ', 'นราธิวาส - เจาะไอร้อง', 'นราธิวาส - บางนร']


        zone_id = -1
        if(postdata['addr_district'][:4] == 'เขต '):
            postdata['addr_district'] = postdata['addr_district'][4:]

        #print(postdata['addr_district'])
        #print(zones[17])

        for i in range(len(zones)):

            if(postdata['addr_district'] in zones[i]):
                zone_id = i+1
                break

        if(zone_id == -1):

            for i in range(len(zones)):
                if (postdata['addr_province'] in zones[i]):
                    zone_id = i + 1
                    break

        addr_subdis = postdata['addr_sub_district']
        response = httprequestObj.http_get('https://www.aecmarketinghome.com/th/post/get_subdistrict/'+str(zone_id))
        result = json.loads(response.content.decode('utf-8'))

        subdistrict_id = ''
        for i in range(len(result)):
            if(addr_subdis in result[i]['subdistrict_name']):
                subdistrict_id = result[i]['subdistrict_id']
                break
        try:
            line_data = postdata['line']
            if(line_data == None):
                line_data = ''
        except:
            line_data = ''

        rent_price = ''
        selling_price = ''

        if(post_type == 'RENTAL'):
            rent_price = postdata['price_baht']
            selling_price = ''

        else:
            selling_price = postdata['price_baht']
            rent_price = ''

        ad_data = {
            'address_no': '',
            'address_road': '',
            'bathroom': postdata['bath_room'],
            'bedroom': postdata['bed_room'],
            'contact_lineid': line_data,
            'contact_name': postdata['name'],
            'contact_phone': postdata['mobile'],
            'detail': postdata['post_description_th'],
            'district_id': zone_id,
            'floor': postdata['floor_total'],
            'floor_no': postdata['floor_level'],
            'land_ngaan': area_ngan,
            'land_rai': area_rai,
            'land_sqw': area_sqw,
            'living': '',
            'location_lat': postdata['geo_latitude'],
            'location_lng': postdata['geo_longitude'],
            'name': postdata['post_title_th'],
            'parking': '',
            'photos[]': image_string,
            'post_type': post_type_no,
            'price': selling_price,
            'price_rent': rent_price,
            'rent_time': '12',
            'subdistrict_id': subdistrict_id,
            'type': property_type[int(postdata['property_type'])],
            'useable_sqm': living_area
        }

        # file = open('test1.html','a')
        # file.write(str(ad_data))

        response = httprequestObj.http_post('https://www.aecmarketinghome.com/th/post/save_property.html', data=ad_data)
        #print(response.content)
        result = json.loads(response.content.decode('utf-8'))
        #print(result)
        try:
            ids = result['result']['redirect'][45:]
            ids = ids.split('-')
            ids = ids[0]
        except:
            ids = 0

        if(result['result']['status_code'] == 200):
            status = True

        else:
            status = False

        end_time = datetime.datetime.utcnow()
        try:
            post_url = result['result']['redirect']

        except:
            post_url = ''


        return {
            "success": status,
            "start_time": str(start_time),
            "ds_id": postdata['ds_id'],
            "end_time": str(end_time),
            "usage_time": str(end_time - start_time),
            "detail": result['result']['description'],
            "post_url" : post_url,
            "post_id" : ids,
            "websitename": "aecmarketing"
        }

    def boost_post(self, postdata):

        self.print_debug('function [' + sys._getframe().f_code.co_name + ']')
        start_time = datetime.datetime.utcnow()

        property_type = {
            1: 3, 2: 1, 3: 2, 4: 2, 5: 5, 6: 6, 7: 4, 8: 4, 9: 8, 10: 7, 25: 7
        }

        login = self.test_login(postdata)
        if(login['success'] == False):
            return login

        post_id = postdata['post_id']

        if (postdata['listing_type'] == 'เช่า'):
            post_type = 'RENTAL'
            post_type_no = 4

        else:
            post_type = 'SELL'
            post_type_no = 1

        if (postdata['land_size_wa'] == None):
            area_sqw = ''
        else:
            area_sqw = postdata['land_size_wa']

        if (postdata['land_size_rai'] == None):
            area_rai = 0

        else:
            area_rai = postdata['land_size_rai']

        if (postdata['land_size_ngan'] == None):
            area_ngan = ''

        else:
            area_ngan = postdata['land_size_ngan']

        if (postdata['floor_area'] == None):
            living_area = ''

        else:
            living_area = postdata['floor_area']


        zones = ['กรุงเทพฯ - พระนคร', 'กรุงเทพฯ - ดุสิต', 'กรุงเทพฯ - หนองจอก', 'กรุงเทพฯ - บางรัก',
                 'กรุงเทพฯ - บางเขน', 'กรุงเทพฯ - บางกะปิ', 'กรุงเทพฯ - ปทุมวัน', 'กรุงเทพฯ - ป้อมปราบศัตรูพ่าย',
                 'กรุงเทพฯ - พระโขนง', 'กรุงเทพฯ - มีนบุรี', 'กรุงเทพฯ - ลาดกระบัง', 'กรุงเทพฯ - ยานนาวา',
                 'กรุงเทพฯ - สัมพันธวงศ์', 'กรุงเทพฯ - พญาไท', 'กรุงเทพฯ - ธนบุรี', 'กรุงเทพฯ - บางกอกใหญ่',
                 'กรุงเทพฯ - ห้วยขวาง', 'กรุงเทพฯ - คลองสาน', 'กรุงเทพฯ - ตลิ่งชัน', 'กรุงเทพฯ - บางกอกน้อย',
                 'กรุงเทพฯ - บางขุนเทียน', 'กรุงเทพฯ - ภาษีเจริญ', 'กรุงเทพฯ - หนองแขม', 'กรุงเทพฯ - ราษฎร์บูรณะ',
                 'กรุงเทพฯ - บางพลัด', 'กรุงเทพฯ - ดินแดง', 'กรุงเทพฯ - บึงกุ่ม', 'กรุงเทพฯ - สาทร',
                 'กรุงเทพฯ - บางซื่อ', 'กรุงเทพฯ - จตุจักร', 'กรุงเทพฯ - บางคอแหลม', 'กรุงเทพฯ - ประเวศ',
                 'กรุงเทพฯ - คลองเตย', 'กรุงเทพฯ - สวนหลวง', 'กรุงเทพฯ - จอมทอง', 'กรุงเทพฯ - ดอนเมือง',
                 'กรุงเทพฯ - ราชเทวี', 'กรุงเทพฯ - ลาดพร้าว', 'กรุงเทพฯ - วัฒนา', 'กรุงเทพฯ - บางแค',
                 'กรุงเทพฯ - หลักสี่', 'กรุงเทพฯ - สายไหม', 'กรุงเทพฯ - คันนายาว', 'กรุงเทพฯ - สะพานสูง',
                 'กรุงเทพฯ - วังทองหลาง', 'กรุงเทพฯ - คลองสามวา', 'กรุงเทพฯ - บางนา', 'กรุงเทพฯ - ทวีวัฒนา',
                 'กรุงเทพฯ - ทุ่งครุ', 'กรุงเทพฯ - บางบอน', 'กรุงเทพฯ - บ้านทะวาย', 'สมุทรปราการ - เมืองสมุทรปราการ',
                 'สมุทรปราการ - บางบ่อ', 'สมุทรปราการ - บางพลี', 'สมุทรปราการ - พระประแดง',
                 'สมุทรปราการ - พระสมุทรเจดีย์', 'สมุทรปราการ - บางเสาธง', 'นนทบุรี - เมืองนนทบุรี',
                 'นนทบุรี - บางกรวย', 'นนทบุรี - บางใหญ่', 'นนทบุรี - บางบัวทอง', 'นนทบุรี - ไทรน้อย',
                 'นนทบุรี - ปากเกร็ด', 'นนทบุรี - เทศบาลนครนนทบุรี (สาขาแขวงท่าทราย)', 'นนทบุรี - เทศบาลเมืองปากเกร็ด',
                 'ปทุมธานี - เมืองปทุมธานี', 'ปทุมธานี - คลองหลวง', 'ปทุมธานี - ธัญบุรี', 'ปทุมธานี - หนองเสือ',
                 'ปทุมธานี - ลาดหลุมแก้ว', 'ปทุมธานี - ลำลูกกา', 'ปทุมธานี - สามโคก',
                 'ปทุมธานี - ลำลูกกา (สาขาตำบลคูคต)', 'พระนครศรีอยุธยา - พระนครศรีอยุธยา', 'พระนครศรีอยุธยา - ท่าเรือ',
                 'พระนครศรีอยุธยา - นครหลวง', 'พระนครศรีอยุธยา - บางไทร', 'พระนครศรีอยุธยา - บางบาล',
                 'พระนครศรีอยุธยา - บางปะอิน', 'พระนครศรีอยุธยา - บางปะหัน', 'พระนครศรีอยุธยา - ผักไห่',
                 'พระนครศรีอยุธยา - ภาชี', 'พระนครศรีอยุธยา - ลาดบัวหลวง', 'พระนครศรีอยุธยา - วังน้อย',
                 'พระนครศรีอยุธยา - เสนา', 'พระนครศรีอยุธยา - บางซ้าย', 'พระนครศรีอยุธยา - อุทัย',
                 'พระนครศรีอยุธยา - มหาราช', 'พระนครศรีอยุธยา - บ้านแพรก', 'อ่างทอง - เมืองอ่างทอง', 'อ่างทอง - ไชโย',
                 'อ่างทอง - ป่าโมก', 'อ่างทอง - โพธิ์ทอง', 'อ่างทอง - แสวงหา', 'อ่างทอง - วิเศษชัยชาญ',
                 'อ่างทอง - สามโก้', 'ลพบุรี - เมืองลพบุรี', 'ลพบุรี - พัฒนานิคม', 'ลพบุรี - โคกสำโรง',
                 'ลพบุรี - ชัยบาดาล', 'ลพบุรี - ท่าวุ้ง', 'ลพบุรี - บ้านหมี่', 'ลพบุรี - ท่าหลวง', 'ลพบุรี - สระโบสถ์',
                 'ลพบุรี - โคกเจริญ', 'ลพบุรี - ลำสนธิ', 'ลพบุรี - หนองม่วง', 'ลพบุรี - บ้านเช่า',
                 'สิงห์บุรี - เมืองสิงห์บุรี', 'สิงห์บุรี - บางระจัน', 'สิงห์บุรี - ค่ายบางระจัน',
                 'สิงห์บุรี - พรหมบุรี', 'สิงห์บุรี - ท่าช้าง', 'สิงห์บุรี - อินทร์บุรี', 'ชัยนาท - เมืองชัยนาท',
                 'ชัยนาท - มโนรมย์', 'ชัยนาท - วัดสิงห์', 'ชัยนาท - สรรพยา', 'ชัยนาท - สรรคบุรี', 'ชัยนาท - หันคา',
                 'ชัยนาท - หนองมะโมง', 'ชัยนาท - เนินขาม', 'สระบุรี - เมืองสระบุรี', 'สระบุรี - แก่งคอย',
                 'สระบุรี - หนองแค', 'สระบุรี - วิหารแดง', 'สระบุรี - หนองแซง', 'สระบุรี - บ้านหมอ', 'สระบุรี - ดอนพุด',
                 'สระบุรี - หนองโดน', 'สระบุรี - พระพุทธบาท', 'สระบุรี - เสาไห้', 'สระบุรี - มวกเหล็ก',
                 'สระบุรี - วังม่วง', 'สระบุรี - เฉลิมพระเกียรติ', 'ชลบุรี - เมืองชลบุรี', 'ชลบุรี - บ้านบึง',
                 'ชลบุรี - หนองใหญ่', 'ชลบุรี - บางละมุง', 'ชลบุรี - พานทอง', 'ชลบุรี - พนัสนิคม', 'ชลบุรี - ศรีราชา',
                 'ชลบุรี - เกาะสีชัง', 'ชลบุรี - สัตหีบ', 'ชลบุรี - บ่อทอง', 'ชลบุรี - เกาะจันทร์',
                 'ชลบุรี - สัตหีบ (สาขาตำบลบางเสร่)', 'ชลบุรี - ท้องถิ่นเทศบาลเมืองหนองปรือ',
                 'ชลบุรี - เทศบาลตำบลแหลมฉบัง', 'ชลบุรี - เทศบาลเมืองชลบุรี', 'ระยอง - เมืองระยอง', 'ระยอง - บ้านฉาง',
                 'ระยอง - แกลง', 'ระยอง - วังจันทร์', 'ระยอง - บ้านค่าย', 'ระยอง - ปลวกแดง', 'ระยอง - เขาชะเมา',
                 'ระยอง - นิคมพัฒนา', 'ระยอง - สาขาตำบลมาบข่า', 'จันทบุรี - เมืองจันทบุรี', 'จันทบุรี - ขลุง',
                 'จันทบุรี - ท่าใหม่', 'จันทบุรี - โป่งน้ำร้อน', 'จันทบุรี - มะขาม', 'จันทบุรี - แหลมสิงห์',
                 'จันทบุรี - สอยดาว', 'จันทบุรี - แก่งหางแมว', 'จันทบุรี - นายายอาม', 'จันทบุรี - เขาคิชฌกูฏ',
                 'จันทบุรี - กิ่งอำเภอกำพุธ', 'ตราด - เมืองตราด', 'ตราด - คลองใหญ่', 'ตราด - เขาสมิง', 'ตราด - บ่อไร่',
                 'ตราด - แหลมงอบ', 'ตราด - เกาะกูด', 'ตราด - เกาะช้าง', 'ฉะเชิงเทรา - เมืองฉะเชิงเทรา',
                 'ฉะเชิงเทรา - บางคล้า', 'ฉะเชิงเทรา - บางน้ำเปรี้ยว', 'ฉะเชิงเทรา - บางปะกง', 'ฉะเชิงเทรา - บ้านโพธิ์',
                 'ฉะเชิงเทรา - พนมสารคาม', 'ฉะเชิงเทรา - ราชสาส์น', 'ฉะเชิงเทรา - สนามชัยเขต', 'ฉะเชิงเทรา - แปลงยาว',
                 'ฉะเชิงเทรา - ท่าตะเกียบ', 'ฉะเชิงเทรา - คลองเขื่อน', 'ปราจีนบุรี - เมืองปราจีนบุรี',
                 'ปราจีนบุรี - กบินทร์บุรี', 'ปราจีนบุรี - นาดี', 'ปราจีนบุรี - สระแก้ว', 'ปราจีนบุรี - วังน้ำเย็น',
                 'ปราจีนบุรี - บ้านสร้าง', 'ปราจีนบุรี - ประจันตคาม', 'ปราจีนบุรี - ศรีมหาโพธิ',
                 'ปราจีนบุรี - ศรีมโหสถ', 'ปราจีนบุรี - อรัญประเทศ', 'ปราจีนบุรี - ตาพระยา', 'ปราจีนบุรี - วัฒนานคร',
                 'ปราจีนบุรี - คลองหาด', 'นครนายก - เมืองนครนายก', 'นครนายก - ปากพลี', 'นครนายก - บ้านนา',
                 'นครนายก - องครักษ์', 'สระแก้ว - เมืองสระแก้ว', 'สระแก้ว - คลองหาด', 'สระแก้ว - ตาพระยา',
                 'สระแก้ว - วังน้ำเย็น', 'สระแก้ว - วัฒนานคร', 'สระแก้ว - อรัญประเทศ', 'สระแก้ว - เขาฉกรรจ์',
                 'สระแก้ว - โคกสูง', 'สระแก้ว - วังสมบูรณ์', 'นครราชสีมา - เมืองนครราชสีมา', 'นครราชสีมา - ครบุรี',
                 'นครราชสีมา - เสิงสาง', 'นครราชสีมา - คง', 'นครราชสีมา - บ้านเหลื่อม', 'นครราชสีมา - จักราช',
                 'นครราชสีมา - โชคชัย', 'นครราชสีมา - ด่านขุนทด', 'นครราชสีมา - โนนไทย', 'นครราชสีมา - โนนสูง',
                 'นครราชสีมา - ขามสะแกแสง', 'นครราชสีมา - บัวใหญ่', 'นครราชสีมา - ประทาย', 'นครราชสีมา - ปักธงชัย',
                 'นครราชสีมา - พิมาย', 'นครราชสีมา - ห้วยแถลง', 'นครราชสีมา - ชุมพวง', 'นครราชสีมา - สูงเนิน',
                 'นครราชสีมา - ขามทะเลสอ', 'นครราชสีมา - สีคิ้ว', 'นครราชสีมา - ปากช่อง', 'นครราชสีมา - หนองบุญมาก',
                 'นครราชสีมา - แก้งสนามนาง', 'นครราชสีมา - โนนแดง', 'นครราชสีมา - วังน้ำเขียว',
                 'นครราชสีมา - เทพารักษ์', 'นครราชสีมา - เมืองยาง', 'นครราชสีมา - พระทองคำ', 'นครราชสีมา - ลำทะเมนชัย',
                 'นครราชสีมา - บัวลาย', 'นครราชสีมา - สีดา', 'นครราชสีมา - เฉลิมพระเกียรติ',
                 'นครราชสีมา - ท้องถิ่นเทศบาลตำบลโพธิ์กลาง', 'นครราชสีมา - สาขาตำบลมะค่า-พลสงคราม',
                 'นครราชสีมา - โนนลาว', 'บุรีรัมย์ - เมืองบุรีรัมย์', 'บุรีรัมย์ - คูเมือง', 'บุรีรัมย์ - กระสัง',
                 'บุรีรัมย์ - นางรอง', 'บุรีรัมย์ - หนองกี่', 'บุรีรัมย์ - ละหานทราย', 'บุรีรัมย์ - ประโคนชัย',
                 'บุรีรัมย์ - บ้านกรวด', 'บุรีรัมย์ - พุทไธสง', 'บุรีรัมย์ - ลำปลายมาศ', 'บุรีรัมย์ - สตึก',
                 'บุรีรัมย์ - ปะคำ', 'บุรีรัมย์ - นาโพธิ์', 'บุรีรัมย์ - หนองหงส์', 'บุรีรัมย์ - พลับพลาชัย',
                 'บุรีรัมย์ - ห้วยราช', 'บุรีรัมย์ - โนนสุวรรณ', 'บุรีรัมย์ - ชำนิ', 'บุรีรัมย์ - บ้านใหม่ไชยพจน์',
                 'บุรีรัมย์ - โนนดินแดง', 'บุรีรัมย์ - บ้านด่าน', 'บุรีรัมย์ - แคนดง', 'บุรีรัมย์ - เฉลิมพระเกียรติ',
                 'สุรินทร์ - เมืองสุรินทร์', 'สุรินทร์ - ชุมพลบุรี', 'สุรินทร์ - ท่าตูม', 'สุรินทร์ - จอมพระ',
                 'สุรินทร์ - ปราสาท', 'สุรินทร์ - กาบเชิง', 'สุรินทร์ - รัตนบุรี', 'สุรินทร์ - สนม',
                 'สุรินทร์ - ศีขรภูมิ', 'สุรินทร์ - สังขะ', 'สุรินทร์ - ลำดวน', 'สุรินทร์ - สำโรงทาบ',
                 'สุรินทร์ - บัวเชด', 'สุรินทร์ - พนมดงรัก', 'สุรินทร์ - ศรีณรงค์', 'สุรินทร์ - เขวาสินรินทร์',
                 'สุรินทร์ - โนนนารายณ์', 'ศรีสะเกษ - เมืองศรีสะเกษ', 'ศรีสะเกษ - ยางชุมน้อย', 'ศรีสะเกษ - กันทรารมย์',
                 'ศรีสะเกษ - กันทรลักษ์', 'ศรีสะเกษ - ขุขันธ์', 'ศรีสะเกษ - ไพรบึง', 'ศรีสะเกษ - ปรางค์กู่',
                 'ศรีสะเกษ - ขุนหาญ', 'ศรีสะเกษ - ราษีไศล', 'ศรีสะเกษ - อุทุมพรพิสัย', 'ศรีสะเกษ - บึงบูรพ์',
                 'ศรีสะเกษ - ห้วยทับทัน', 'ศรีสะเกษ - โนนคูณ', 'ศรีสะเกษ - ศรีรัตนะ', 'ศรีสะเกษ - น้ำเกลี้ยง',
                 'ศรีสะเกษ - วังหิน', 'ศรีสะเกษ - ภูสิงห์', 'ศรีสะเกษ - เมืองจันทร์', 'ศรีสะเกษ - เบญจลักษ์',
                 'ศรีสะเกษ - พยุห์', 'ศรีสะเกษ - โพธิ์ศรีสุวรรณ', 'ศรีสะเกษ - ศิลาลาด',
                 'อุบลราชธานี - เมืองอุบลราชธานี', 'อุบลราชธานี - ศรีเมืองใหม่', 'อุบลราชธานี - โขงเจียม',
                 'อุบลราชธานี - เขื่องใน', 'อุบลราชธานี - เขมราฐ', 'อุบลราชธานี - ชานุมาน', 'อุบลราชธานี - เดชอุดม',
                 'อุบลราชธานี - นาจะหลวย', 'อุบลราชธานี - น้ำยืน', 'อุบลราชธานี - บุณฑริก', 'อุบลราชธานี - ตระการพืชผล',
                 'อุบลราชธานี - กุดข้าวปุ้น', 'อุบลราชธานี - พนา', 'อุบลราชธานี - ม่วงสามสิบ',
                 'อุบลราชธานี - วารินชำราบ', 'อุบลราชธานี - อำนาจเจริญ', 'อุบลราชธานี - เสนางคนิคม',
                 'อุบลราชธานี - หัวตะพาน', 'อุบลราชธานี - พิบูลมังสาหาร', 'อุบลราชธานี - ตาลสุม',
                 'อุบลราชธานี - โพธิ์ไทร', 'อุบลราชธานี - สำโรง', 'อุบลราชธานี - กิ่งอำเภอลืออำนาจ',
                 'อุบลราชธานี - ดอนมดแดง', 'อุบลราชธานี - สิรินธร', 'อุบลราชธานี - ทุ่งศรีอุดม',
                 'อุบลราชธานี - ปทุมราชวงศา', 'อุบลราชธานี - กิ่งอำเภอศรีหลักชัย', 'อุบลราชธานี - นาเยีย',
                 'อุบลราชธานี - นาตาล', 'อุบลราชธานี - เหล่าเสือโก้ก', 'อุบลราชธานี - สว่างวีระวงศ์',
                 'อุบลราชธานี - น้ำขุ่น', 'อุบลราชธานี - สุวรรณวารี', 'ยโสธร - เมืองยโสธร', 'ยโสธร - ทรายมูล',
                 'ยโสธร - กุดชุม', 'ยโสธร - คำเขื่อนแก้ว', 'ยโสธร - ป่าติ้ว', 'ยโสธร - มหาชนะชัย', 'ยโสธร - ค้อวัง',
                 'ยโสธร - เลิงนกทา', 'ยโสธร - ไทยเจริญ', 'ชัยภูมิ - เมืองชัยภูมิ', 'ชัยภูมิ - บ้านเขว้า',
                 'ชัยภูมิ - คอนสวรรค์', 'ชัยภูมิ - เกษตรสมบูรณ์', 'ชัยภูมิ - หนองบัวแดง', 'ชัยภูมิ - จัตุรัส',
                 'ชัยภูมิ - บำเหน็จณรงค์', 'ชัยภูมิ - หนองบัวระเหว', 'ชัยภูมิ - เทพสถิต', 'ชัยภูมิ - ภูเขียว',
                 'ชัยภูมิ - บ้านแท่น', 'ชัยภูมิ - แก้งคร้อ', 'ชัยภูมิ - คอนสาร', 'ชัยภูมิ - ภักดีชุมพล',
                 'ชัยภูมิ - เนินสง่า', 'ชัยภูมิ - ซับใหญ่', 'ชัยภูมิ - เมืองชัยภูมิ (สาขาตำบลโนนสำราญ)',
                 'ชัยภูมิ - สาขาตำบลบ้านหว่าเฒ่า', 'ชัยภูมิ - หนองบัวแดง (สาขาตำบลวังชมภู)',
                 'ชัยภูมิ - กิ่งอำเภอซับใหญ่ (สาขาตำบลซับใหญ่)', 'ชัยภูมิ - สาขาตำบลโคกเพชร',
                 'ชัยภูมิ - เทพสถิต (สาขาตำบลนายางกลัก)', 'ชัยภูมิ - บ้านแท่น (สาขาตำบลบ้านเต่า)',
                 'ชัยภูมิ - แก้งคร้อ (สาขาตำบลท่ามะไฟหวาน)', 'ชัยภูมิ - คอนสาร (สาขาตำบลโนนคูณ)',
                 'อำนาจเจริญ - เมืองอำนาจเจริญ', 'อำนาจเจริญ - ชานุมาน', 'อำนาจเจริญ - ปทุมราชวงศา', 'อำนาจเจริญ - พนา',
                 'อำนาจเจริญ - เสนางคนิคม', 'อำนาจเจริญ - หัวตะพาน', 'อำนาจเจริญ - ลืออำนาจ', 'บึงกาฬ - เมืองบึงกาฬ',
                 'บึงกาฬ - เซกา', 'บึงกาฬ - โซ่พิสัย', 'บึงกาฬ - พรเจริญ', 'บึงกาฬ - ศรีวิไล', 'บึงกาฬ - บึงโขงหลง',
                 'บึงกาฬ - ปากคาด', 'บึงกาฬ - บุ่งคล้า', 'หนองบัวลำภู - เมืองหนองบัวลำภู', 'หนองบัวลำภู - นากลาง',
                 'หนองบัวลำภู - โนนสัง', 'หนองบัวลำภู - ศรีบุญเรือง', 'หนองบัวลำภู - สุวรรณคูหา', 'หนองบัวลำภู - นาวัง',
                 'ขอนแก่น - เมืองขอนแก่น', 'ขอนแก่น - บ้านฝาง', 'ขอนแก่น - พระยืน', 'ขอนแก่น - หนองเรือ',
                 'ขอนแก่น - ชุมแพ', 'ขอนแก่น - สีชมพู', 'ขอนแก่น - น้ำพอง', 'ขอนแก่น - อุบลรัตน์', 'ขอนแก่น - กระนวน',
                 'ขอนแก่น - บ้านไผ่', 'ขอนแก่น - เปือยน้อย', 'ขอนแก่น - พล', 'ขอนแก่น - แวงใหญ่', 'ขอนแก่น - แวงน้อย',
                 'ขอนแก่น - หนองสองห้อง', 'ขอนแก่น - ภูเวียง', 'ขอนแก่น - มัญจาคีรี', 'ขอนแก่น - ชนบท',
                 'ขอนแก่น - เขาสวนกวาง', 'ขอนแก่น - ภูผาม่าน', 'ขอนแก่น - ซำสูง', 'ขอนแก่น - โคกโพธิ์ไชย',
                 'ขอนแก่น - หนองนาคำ', 'ขอนแก่น - บ้านแฮด', 'ขอนแก่น - โนนศิลา', 'ขอนแก่น - เวียงเก่า',
                 'ขอนแก่น - ท้องถิ่นเทศบาลตำบลบ้านเป็ด', 'ขอนแก่น - เทศบาลตำบลเมืองพล', 'อุดรธานี - เมืองอุดรธานี',
                 'อุดรธานี - กุดจับ', 'อุดรธานี - หนองวัวซอ', 'อุดรธานี - กุมภวาปี', 'อุดรธานี - โนนสะอาด',
                 'อุดรธานี - หนองหาน', 'อุดรธานี - ทุ่งฝน', 'อุดรธานี - ไชยวาน', 'อุดรธานี - ศรีธาตุ',
                 'อุดรธานี - วังสามหมอ', 'อุดรธานี - บ้านดุง', 'อุดรธานี - หนองบัวลำภู', 'อุดรธานี - ศรีบุญเรือง',
                 'อุดรธานี - นากลาง', 'อุดรธานี - สุวรรณคูหา', 'อุดรธานี - โนนสัง', 'อุดรธานี - บ้านผือ',
                 'อุดรธานี - น้ำโสม', 'อุดรธานี - เพ็ญ', 'อุดรธานี - สร้างคอม', 'อุดรธานี - หนองแสง',
                 'อุดรธานี - นายูง', 'อุดรธานี - พิบูลย์รักษ์', 'อุดรธานี - กู่แก้ว', 'อุดรธานี - ประจักษ์ศิลปาคม',
                 'เลย - เมืองเลย', 'เลย - นาด้วง', 'เลย - เชียงคาน', 'เลย - ปากชม', 'เลย - ด่านซ้าย', 'เลย - นาแห้ว',
                 'เลย - ภูเรือ', 'เลย - ท่าลี่', 'เลย - วังสะพุง', 'เลย - ภูกระดึง', 'เลย - ภูหลวง', 'เลย - ผาขาว',
                 'เลย - เอราวัณ', 'เลย - หนองหิน', 'หนองคาย - เมืองหนองคาย', 'หนองคาย - ท่าบ่อ', '- เมืองบึงกาฬ',
                 '- พรเจริญ', 'หนองคาย - โพนพิสัย', '- โซ่พิสัย', 'หนองคาย - ศรีเชียงใหม่', 'หนองคาย - สังคม', '- เซกา',
                 '- ปากคาด', '- บึงโขงหลง', '- ศรีวิไล', '- บุ่งคล้า', 'หนองคาย - สระใคร', 'หนองคาย - เฝ้าไร่',
                 'หนองคาย - รัตนวาปี', 'หนองคาย - โพธิ์ตาก', 'มหาสารคาม - เมืองมหาสารคาม', 'มหาสารคาม - แกดำ',
                 'มหาสารคาม - โกสุมพิสัย', 'มหาสารคาม - กันทรวิชัย', 'มหาสารคาม - เชียงยืน', 'มหาสารคาม - บรบือ',
                 'มหาสารคาม - นาเชือก', 'มหาสารคาม - พยัคฆภูมิพิสัย', 'มหาสารคาม - วาปีปทุม', 'มหาสารคาม - นาดูน',
                 'มหาสารคาม - ยางสีสุราช', 'มหาสารคาม - กุดรัง', 'มหาสารคาม - ชื่นชม', 'มหาสารคาม - หลุบ',
                 'ร้อยเอ็ด - เมืองร้อยเอ็ด', 'ร้อยเอ็ด - เกษตรวิสัย', 'ร้อยเอ็ด - ปทุมรัตต์',
                 'ร้อยเอ็ด - จตุรพักตรพิมาน', 'ร้อยเอ็ด - ธวัชบุรี', 'ร้อยเอ็ด - พนมไพร', 'ร้อยเอ็ด - โพนทอง',
                 'ร้อยเอ็ด - โพธิ์ชัย', 'ร้อยเอ็ด - หนองพอก', 'ร้อยเอ็ด - เสลภูมิ', 'ร้อยเอ็ด - สุวรรณภูมิ',
                 'ร้อยเอ็ด - เมืองสรวง', 'ร้อยเอ็ด - โพนทราย', 'ร้อยเอ็ด - อาจสามารถ', 'ร้อยเอ็ด - เมยวดี',
                 'ร้อยเอ็ด - ศรีสมเด็จ', 'ร้อยเอ็ด - จังหาร', 'ร้อยเอ็ด - เชียงขวัญ', 'ร้อยเอ็ด - หนองฮี',
                 'ร้อยเอ็ด - ทุ่งเขาหลวง', 'กาฬสินธุ์ - เมืองกาฬสินธุ์', 'กาฬสินธุ์ - นามน', 'กาฬสินธุ์ - กมลาไสย',
                 'กาฬสินธุ์ - ร่องคำ', 'กาฬสินธุ์ - กุฉินารายณ์', 'กาฬสินธุ์ - เขาวง', 'กาฬสินธุ์ - ยางตลาด',
                 'กาฬสินธุ์ - ห้วยเม็ก', 'กาฬสินธุ์ - สหัสขันธ์', 'กาฬสินธุ์ - คำม่วง', 'กาฬสินธุ์ - ท่าคันโท',
                 'กาฬสินธุ์ - หนองกุงศรี', 'กาฬสินธุ์ - สมเด็จ', 'กาฬสินธุ์ - ห้วยผึ้ง', 'กาฬสินธุ์ - สามชัย',
                 'กาฬสินธุ์ - นาคู', 'กาฬสินธุ์ - ดอนจาน', 'กาฬสินธุ์ - ฆ้องชัย', 'สกลนคร - เมืองสกลนคร',
                 'สกลนคร - กุสุมาลย์', 'สกลนคร - กุดบาก', 'สกลนคร - พรรณานิคม', 'สกลนคร - พังโคน', 'สกลนคร - วาริชภูมิ',
                 'สกลนคร - นิคมน้ำอูน', 'สกลนคร - วานรนิวาส', 'สกลนคร - คำตากล้า', 'สกลนคร - บ้านม่วง',
                 'สกลนคร - อากาศอำนวย', 'สกลนคร - สว่างแดนดิน', 'สกลนคร - ส่องดาว', 'สกลนคร - เต่างอย',
                 'สกลนคร - โคกศรีสุพรรณ', 'สกลนคร - เจริญศิลป์', 'สกลนคร - โพนนาแก้ว', 'สกลนคร - ภูพาน',
                 'สกลนคร - วานรนิวาส', 'สกลนคร - บ้านหัน', 'นครพนม - เมืองนครพนม', 'นครพนม - ปลาปาก',
                 'นครพนม - ท่าอุเทน', 'นครพนม - บ้านแพง', 'นครพนม - ธาตุพนม', 'นครพนม - เรณูนคร', 'นครพนม - นาแก',
                 'นครพนม - ศรีสงคราม', 'นครพนม - นาหว้า', 'นครพนม - โพนสวรรค์', 'นครพนม - นาทม', 'นครพนม - วังยาง',
                 'มุกดาหาร - เมืองมุกดาหาร', 'มุกดาหาร - นิคมคำสร้อย', 'มุกดาหาร - ดอนตาล', 'มุกดาหาร - ดงหลวง',
                 'มุกดาหาร - คำชะอี', 'มุกดาหาร - หว้านใหญ่', 'มุกดาหาร - หนองสูง', 'เชียงใหม่ - เมืองเชียงใหม่',
                 'เชียงใหม่ - จอมทอง', 'เชียงใหม่ - แม่แจ่ม', 'เชียงใหม่ - เชียงดาว', 'เชียงใหม่ - ดอยสะเก็ด',
                 'เชียงใหม่ - แม่แตง', 'เชียงใหม่ - แม่ริม', 'เชียงใหม่ - สะเมิง', 'เชียงใหม่ - ฝาง',
                 'เชียงใหม่ - แม่อาย', 'เชียงใหม่ - พร้าว', 'เชียงใหม่ - สันป่าตอง', 'เชียงใหม่ - สันกำแพง',
                 'เชียงใหม่ - สันทราย', 'เชียงใหม่ - หางดง', 'เชียงใหม่ - ฮอด', 'เชียงใหม่ - ดอยเต่า',
                 'เชียงใหม่ - อมก๋อย', 'เชียงใหม่ - สารภี', 'เชียงใหม่ - เวียงแหง', 'เชียงใหม่ - ไชยปราการ',
                 'เชียงใหม่ - แม่วาง', 'เชียงใหม่ - แม่ออน', 'เชียงใหม่ - ดอยหล่อ',
                 'เชียงใหม่ - เทศบาลนครเชียงใหม่ (สาขาแขวงกาลวิละ)', 'เชียงใหม่ - เทศบาลนครเชียงใหม่ (สาขาแขวงศรีวิชั)',
                 'เชียงใหม่ - เทศบาลนครเชียงใหม่ (สาขาเม็งราย)', 'ลำพูน - เมืองลำพูน', 'ลำพูน - แม่ทา',
                 'ลำพูน - บ้านโฮ่ง', 'ลำพูน - ลี้', 'ลำพูน - ทุ่งหัวช้าง', 'ลำพูน - ป่าซาง', 'ลำพูน - บ้านธิ',
                 'ลำพูน - เวียงหนองล่อง', 'ลำปาง - เมืองลำปาง', 'ลำปาง - แม่เมาะ', 'ลำปาง - เกาะคา', 'ลำปาง - เสริมงาม',
                 'ลำปาง - งาว', 'ลำปาง - แจ้ห่ม', 'ลำปาง - วังเหนือ', 'ลำปาง - เถิน', 'ลำปาง - แม่พริก',
                 'ลำปาง - แม่ทะ', 'ลำปาง - สบปราบ', 'ลำปาง - ห้างฉัตร', 'ลำปาง - เมืองปาน',
                 'อุตรดิตถ์ - เมืองอุตรดิตถ์', 'อุตรดิตถ์ - ตรอน', 'อุตรดิตถ์ - ท่าปลา', 'อุตรดิตถ์ - น้ำปาด',
                 'อุตรดิตถ์ - ฟากท่า', 'อุตรดิตถ์ - บ้านโคก', 'อุตรดิตถ์ - พิชัย', 'อุตรดิตถ์ - ลับแล',
                 'อุตรดิตถ์ - ทองแสนขัน', 'แพร่ - เมืองแพร่', 'แพร่ - ร้องกวาง', 'แพร่ - ลอง', 'แพร่ - สูงเม่น',
                 'แพร่ - เด่นชัย', 'แพร่ - สอง', 'แพร่ - วังชิ้น', 'แพร่ - หนองม่วงไข่', 'น่าน - เมืองน่าน',
                 'น่าน - แม่จริม', 'น่าน - บ้านหลวง', 'น่าน - นาน้อย', 'น่าน - ปัว', 'น่าน - ท่าวังผา',
                 'น่าน - เวียงสา', 'น่าน - ทุ่งช้าง', 'น่าน - เชียงกลาง', 'น่าน - นาหมื่น', 'น่าน - สันติสุข',
                 'น่าน - บ่อเกลือ', 'น่าน - สองแคว', 'น่าน - ภูเพียง', 'น่าน - เฉลิมพระเกียรติ', 'พะเยา - เมืองพะเยา',
                 'พะเยา - จุน', 'พะเยา - เชียงคำ', 'พะเยา - เชียงม่วน', 'พะเยา - ดอกคำใต้', 'พะเยา - ปง',
                 'พะเยา - แม่ใจ', 'พะเยา - ภูซาง', 'พะเยา - ภูกามยาว', 'เชียงราย - เมืองเชียงราย',
                 'เชียงราย - เวียงชัย', 'เชียงราย - เชียงของ', 'เชียงราย - เทิง', 'เชียงราย - พาน', 'เชียงราย - ป่าแดด',
                 'เชียงราย - แม่จัน', 'เชียงราย - เชียงแสน', 'เชียงราย - แม่สาย', 'เชียงราย - แม่สรวย',
                 'เชียงราย - เวียงป่าเป้า', 'เชียงราย - พญาเม็งราย', 'เชียงราย - เวียงแก่น', 'เชียงราย - ขุนตาล',
                 'เชียงราย - แม่ฟ้าหลวง', 'เชียงราย - แม่ลาว', 'เชียงราย - เวียงเชียงรุ้ง', 'เชียงราย - ดอยหลวง',
                 'แม่ฮ่องสอน - เมืองแม่ฮ่องสอน', 'แม่ฮ่องสอน - ขุนยวม', 'แม่ฮ่องสอน - ปาย', 'แม่ฮ่องสอน - แม่สะเรียง',
                 'แม่ฮ่องสอน - แม่ลาน้อย', 'แม่ฮ่องสอน - สบเมย', 'แม่ฮ่องสอน - ปางมะผ้า', 'แม่ฮ่องสอน - ม่วยต่อ',
                 'นครสวรรค์ - เมืองนครสวรรค์', 'นครสวรรค์ - โกรกพระ', 'นครสวรรค์ - ชุมแสง', 'นครสวรรค์ - หนองบัว',
                 'นครสวรรค์ - บรรพตพิสัย', 'นครสวรรค์ - เก้าเลี้ยว', 'นครสวรรค์ - ตาคลี', 'นครสวรรค์ - ท่าตะโก',
                 'นครสวรรค์ - ไพศาลี', 'นครสวรรค์ - พยุหะคีรี', 'นครสวรรค์ - ลาดยาว', 'นครสวรรค์ - ตากฟ้า',
                 'นครสวรรค์ - แม่วงก์', 'นครสวรรค์ - แม่เปิน', 'นครสวรรค์ - ชุมตาบง', 'นครสวรรค์ - สาขาตำบลห้วยน้ำหอม',
                 'นครสวรรค์ - กิ่งอำเภอชุมตาบง (สาขาตำบลชุมตาบง)', 'นครสวรรค์ - แม่วงก์ (สาขาตำบลแม่เล่ย์)',
                 'อุทัยธานี - เมืองอุทัยธานี', 'อุทัยธานี - ทัพทัน', 'อุทัยธานี - สว่างอารมณ์', 'อุทัยธานี - หนองฉาง',
                 'อุทัยธานี - หนองขาหย่าง', 'อุทัยธานี - บ้านไร่', 'อุทัยธานี - ลานสัก', 'อุทัยธานี - ห้วยคต',
                 'กำแพงเพชร - เมืองกำแพงเพชร', 'กำแพงเพชร - ไทรงาม', 'กำแพงเพชร - คลองลาน',
                 'กำแพงเพชร - ขาณุวรลักษบุรี', 'กำแพงเพชร - คลองขลุง', 'กำแพงเพชร - พรานกระต่าย',
                 'กำแพงเพชร - ลานกระบือ', 'กำแพงเพชร - ทรายทองวัฒนา', 'กำแพงเพชร - ปางศิลาทอง',
                 'กำแพงเพชร - บึงสามัคคี', 'กำแพงเพชร - โกสัมพีนคร', 'ตาก - เมืองตาก', 'ตาก - บ้านตาก', 'ตาก - สามเงา',
                 'ตาก - แม่ระมาด', 'ตาก - ท่าสองยาง', 'ตาก - แม่สอด', 'ตาก - พบพระ', 'ตาก - อุ้มผาง', 'ตาก - วังเจ้า',
                 'ตาก - กิ่งอำเภอท่าปุย', 'สุโขทัย - เมืองสุโขทัย', 'สุโขทัย - บ้านด่านลานหอย', 'สุโขทัย - คีรีมาศ',
                 'สุโขทัย - กงไกรลาศ', 'สุโขทัย - ศรีสัชนาลัย', 'สุโขทัย - ศรีสำโรง', 'สุโขทัย - สวรรคโลก',
                 'สุโขทัย - ศรีนคร', 'สุโขทัย - ทุ่งเสลี่ยม', 'พิษณุโลก - เมืองพิษณุโลก', 'พิษณุโลก - นครไทย',
                 'พิษณุโลก - ชาติตระการ', 'พิษณุโลก - บางระกำ', 'พิษณุโลก - บางกระทุ่ม', 'พิษณุโลก - พรหมพิราม',
                 'พิษณุโลก - วัดโบสถ์', 'พิษณุโลก - วังทอง', 'พิษณุโลก - เนินมะปราง', 'พิจิตร - เมืองพิจิตร',
                 'พิจิตร - วังทรายพูน', 'พิจิตร - โพธิ์ประทับช้าง', 'พิจิตร - ตะพานหิน', 'พิจิตร - บางมูลนาก',
                 'พิจิตร - โพทะเล', 'พิจิตร - สามง่าม', 'พิจิตร - ทับคล้อ', 'พิจิตร - สากเหล็ก', 'พิจิตร - บึงนาราง',
                 'พิจิตร - ดงเจริญ', 'พิจิตร - วชิรบารมี', 'เพชรบูรณ์ - เมืองเพชรบูรณ์', 'เพชรบูรณ์ - ชนแดน',
                 'เพชรบูรณ์ - หล่มสัก', 'เพชรบูรณ์ - หล่มเก่า', 'เพชรบูรณ์ - วิเชียรบุรี', 'เพชรบูรณ์ - ศรีเทพ',
                 'เพชรบูรณ์ - หนองไผ่', 'เพชรบูรณ์ - บึงสามพัน', 'เพชรบูรณ์ - น้ำหนาว', 'เพชรบูรณ์ - วังโป่ง',
                 'เพชรบูรณ์ - เขาค้อ', 'ราชบุรี - เมืองราชบุรี', 'ราชบุรี - จอมบึง', 'ราชบุรี - สวนผึ้ง',
                 'ราชบุรี - ดำเนินสะดวก', 'ราชบุรี - บ้านโป่ง', 'ราชบุรี - บางแพ', 'ราชบุรี - โพธาราม',
                 'ราชบุรี - ปากท่อ', 'ราชบุรี - วัดเพลง', 'ราชบุรี - บ้านคา', 'ราชบุรี - ท้องถิ่นเทศบาลตำบลบ้านฆ้อง',
                 'กาญจนบุรี - เมืองกาญจนบุรี', 'กาญจนบุรี - ไทรโยค', 'กาญจนบุรี - บ่อพลอย', 'กาญจนบุรี - ศรีสวัสดิ์',
                 'กาญจนบุรี - ท่ามะกา', 'กาญจนบุรี - ท่าม่วง', 'กาญจนบุรี - ทองผาภูมิ', 'กาญจนบุรี - สังขละบุรี',
                 'กาญจนบุรี - พนมทวน', 'กาญจนบุรี - เลาขวัญ', 'กาญจนบุรี - ด่านมะขามเตี้ย', 'กาญจนบุรี - หนองปรือ',
                 'กาญจนบุรี - ห้วยกระเจา', 'กาญจนบุรี - สาขาตำบลท่ากระดาน', 'กาญจนบุรี - บ้านทวน',
                 'สุพรรณบุรี - เมืองสุพรรณบุรี', 'สุพรรณบุรี - เดิมบางนางบวช', 'สุพรรณบุรี - ด่านช้าง',
                 'สุพรรณบุรี - บางปลาม้า', 'สุพรรณบุรี - ศรีประจันต์', 'สุพรรณบุรี - ดอนเจดีย์',
                 'สุพรรณบุรี - สองพี่น้อง', 'สุพรรณบุรี - สามชุก', 'สุพรรณบุรี - อู่ทอง', 'สุพรรณบุรี - หนองหญ้าไซ',
                 'นครปฐม - เมืองนครปฐม', 'นครปฐม - กำแพงแสน', 'นครปฐม - นครชัยศรี', 'นครปฐม - ดอนตูม',
                 'นครปฐม - บางเลน', 'นครปฐม - สามพราน', 'นครปฐม - พุทธมณฑล', 'สมุทรสาคร - เมืองสมุทรสาคร',
                 'สมุทรสาคร - กระทุ่มแบน', 'สมุทรสาคร - บ้านแพ้ว', 'สมุทรสงคราม - เมืองสมุทรสงคราม',
                 'สมุทรสงคราม - บางคนที', 'สมุทรสงคราม - อัมพวา', 'เพชรบุรี - เมืองเพชรบุรี', 'เพชรบุรี - เขาย้อย',
                 'เพชรบุรี - หนองหญ้าปล้อง', 'เพชรบุรี - ชะอำ', 'เพชรบุรี - ท่ายาง', 'เพชรบุรี - บ้านลาด',
                 'เพชรบุรี - บ้านแหลม', 'เพชรบุรี - แก่งกระจาน', 'ประจวบคีรีขันธ์ - เมืองประจวบคีรีขันธ์',
                 'ประจวบคีรีขันธ์ - กุยบุรี', 'ประจวบคีรีขันธ์ - ทับสะแก', 'ประจวบคีรีขันธ์ - บางสะพาน',
                 'ประจวบคีรีขันธ์ - บางสะพานน้อย', 'ประจวบคีรีขันธ์ - ปราณบุรี', 'ประจวบคีรีขันธ์ - หัวหิน',
                 'ประจวบคีรีขันธ์ - สามร้อยยอด', 'นครศรีธรรมราช - เมืองนครศรีธรรมราช', 'นครศรีธรรมราช - พรหมคีรี',
                 'นครศรีธรรมราช - ลานสกา', 'นครศรีธรรมราช - ฉวาง', 'นครศรีธรรมราช - พิปูน', 'นครศรีธรรมราช - เชียรใหญ่',
                 'นครศรีธรรมราช - ชะอวด', 'นครศรีธรรมราช - ท่าศาลา', 'นครศรีธรรมราช - ทุ่งสง', 'นครศรีธรรมราช - นาบอน',
                 'นครศรีธรรมราช - ทุ่งใหญ่', 'นครศรีธรรมราช - ปากพนัง', 'นครศรีธรรมราช - ร่อนพิบูลย์',
                 'นครศรีธรรมราช - สิชล', 'นครศรีธรรมราช - ขนอม', 'นครศรีธรรมราช - หัวไทร', 'นครศรีธรรมราช - บางขัน',
                 'นครศรีธรรมราช - ถ้ำพรรณรา', 'นครศรีธรรมราช - จุฬาภรณ์', 'นครศรีธรรมราช - พระพรหม',
                 'นครศรีธรรมราช - นบพิตำ', 'นครศรีธรรมราช - ช้างกลาง', 'นครศรีธรรมราช - เฉลิมพระเกียรติ',
                 'นครศรีธรรมราช - เชียรใหญ่ (สาขาตำบลเสือหึง)', 'นครศรีธรรมราช - สาขาตำบลสวนหลวง',
                 'นครศรีธรรมราช - ร่อนพิบูลย์ (สาขาตำบลหินตก)', 'นครศรีธรรมราช - หัวไทร (สาขาตำบลควนชะลิก)',
                 'นครศรีธรรมราช - ทุ่งสง (สาขาตำบลกะปาง)', 'กระบี่ - เมืองกระบี่', 'กระบี่ - เขาพนม',
                 'กระบี่ - เกาะลันตา', 'กระบี่ - คลองท่อม', 'กระบี่ - อ่าวลึก', 'กระบี่ - ปลายพระยา', 'กระบี่ - ลำทับ',
                 'กระบี่ - เหนือคลอง', 'พังงา - เมืองพังงา', 'พังงา - เกาะยาว', 'พังงา - กะปง', 'พังงา - ตะกั่วทุ่ง',
                 'พังงา - ตะกั่วป่า', 'พังงา - คุระบุรี', 'พังงา - ทับปุด', 'พังงา - ท้ายเหมือง',
                 'ภูเก็ต - เมืองภูเก็ต', 'ภูเก็ต - กะทู้', 'ภูเก็ต - ถลาง', 'ภูเก็ต - ทุ่งคา',
                 'สุราษฎร์ธานี - เมืองสุราษฎร์ธานี', 'สุราษฎร์ธานี - กาญจนดิษฐ์', 'สุราษฎร์ธานี - ดอนสัก',
                 'สุราษฎร์ธานี - เกาะสมุย', 'สุราษฎร์ธานี - เกาะพะงัน', 'สุราษฎร์ธานี - ไชยา', 'สุราษฎร์ธานี - ท่าชนะ',
                 'สุราษฎร์ธานี - คีรีรัฐนิคม', 'สุราษฎร์ธานี - บ้านตาขุน', 'สุราษฎร์ธานี - พนม',
                 'สุราษฎร์ธานี - ท่าฉาง', 'สุราษฎร์ธานี - บ้านนาสาร', 'สุราษฎร์ธานี - บ้านนาเดิม',
                 'สุราษฎร์ธานี - เคียนซา', 'สุราษฎร์ธานี - เวียงสระ', 'สุราษฎร์ธานี - พระแสง', 'สุราษฎร์ธานี - พุนพิน',
                 'สุราษฎร์ธานี - ชัยบุรี', 'สุราษฎร์ธานี - วิภาวดี', 'สุราษฎร์ธานี - เกาะพงัน',
                 'สุราษฎร์ธานี - บ้านดอน', 'ระนอง - เมืองระนอง', 'ระนอง - ละอุ่น', 'ระนอง - กะเปอร์', 'ระนอง - กระบุรี',
                 'ระนอง - สุขสำราญ', 'ชุมพร - เมืองชุมพร', 'ชุมพร - ท่าแซะ', 'ชุมพร - ปะทิว', 'ชุมพร - หลังสวน',
                 'ชุมพร - ละแม', 'ชุมพร - พะโต๊ะ', 'ชุมพร - สวี', 'ชุมพร - ทุ่งตะโก', 'สงขลา - เมืองสงขลา',
                 'สงขลา - สทิงพระ', 'สงขลา - จะนะ', 'สงขลา - นาทวี', 'สงขลา - เทพา', 'สงขลา - สะบ้าย้อย',
                 'สงขลา - ระโนด', 'สงขลา - กระแสสินธุ์', 'สงขลา - รัตภูมิ', 'สงขลา - สะเดา', 'สงขลา - หาดใหญ่',
                 'สงขลา - นาหม่อม', 'สงขลา - ควนเนียง', 'สงขลา - บางกล่ำ', 'สงขลา - สิงหนคร', 'สงขลา - คลองหอยโข่ง',
                 'สงขลา - ท้องถิ่นเทศบาลตำบลสำนักขาม', 'สงขลา - เทศบาลตำบลบ้านพรุ', 'สตูล - เมืองสตูล', 'สตูล - ควนโดน',
                 'สตูล - ควนกาหลง', 'สตูล - ท่าแพ', 'สตูล - ละงู', 'สตูล - ทุ่งหว้า', 'สตูล - มะนัง',
                 'ตรัง - เมืองตรัง', 'ตรัง - กันตัง', 'ตรัง - ย่านตาขาว', 'ตรัง - ปะเหลียน', 'ตรัง - สิเกา',
                 'ตรัง - ห้วยยอด', 'ตรัง - วังวิเศษ', 'ตรัง - นาโยง', 'ตรัง - รัษฎา', 'ตรัง - หาดสำราญ',
                 'ตรัง - อำเภอเมืองตรัง(สาขาคลองเต็ง)', 'พัทลุง - เมืองพัทลุง', 'พัทลุง - กงหรา', 'พัทลุง - เขาชัยสน',
                 'พัทลุง - ตะโหมด', 'พัทลุง - ควนขนุน', 'พัทลุง - ปากพะยูน', 'พัทลุง - ศรีบรรพต', 'พัทลุง - ป่าบอน',
                 'พัทลุง - บางแก้ว', 'พัทลุง - ป่าพะยอม', 'พัทลุง - ศรีนครินทร์', 'ปัตตานี - เมืองปัตตานี',
                 'ปัตตานี - โคกโพธิ์', 'ปัตตานี - หนองจิก', 'ปัตตานี - ปะนาเระ', 'ปัตตานี - มายอ',
                 'ปัตตานี - ทุ่งยางแดง', 'ปัตตานี - สายบุรี', 'ปัตตานี - ไม้แก่น', 'ปัตตานี - ยะหริ่ง',
                 'ปัตตานี - ยะรัง', 'ปัตตานี - กะพ้อ', 'ปัตตานี - แม่ลาน', 'ยะลา - เมืองยะลา', 'ยะลา - เบตง',
                 'ยะลา - บันนังสตา', 'ยะลา - ธารโต', 'ยะลา - ยะหา', 'ยะลา - รามัน', 'ยะลา - กาบัง', 'ยะลา - กรงปินัง',
                 'นราธิวาส - เมืองนราธิวาส', 'นราธิวาส - ตากใบ', 'นราธิวาส - บาเจาะ', 'นราธิวาส - ยี่งอ',
                 'นราธิวาส - ระแงะ', 'นราธิวาส - รือเสาะ', 'นราธิวาส - ศรีสาคร', 'นราธิวาส - แว้ง',
                 'นราธิวาส - สุคิริน', 'นราธิวาส - สุไหงโก-ลก', 'นราธิวาส - สุไหงปาดี', 'นราธิวาส - จะแนะ',
                 'นราธิวาส - เจาะไอร้อง', 'นราธิวาส - บางนร']

        zone_id = -1

        if (postdata['addr_district'][:4] == 'เขต '):
            postdata['addr_district'] = postdata['addr_district'][4:]

        for i in range(len(zones)):

            if (postdata['addr_district'] in zones[i]):
                zone_id = i + 1
                break

        if (zone_id == -1):

            for i in range(len(zones)):
                if (postdata['addr_province'] in zones[i]):
                    zone_id = i + 1
                    break

        addr_subdis = postdata['addr_sub_district']
        response = httprequestObj.http_get('https://www.aecmarketinghome.com/th/post/get_subdistrict/' + str(zone_id))
        result = json.loads(response.content.decode('utf-8'))

        subdistrict_id = ''
        for i in range(len(result)):
            if (addr_subdis in result[i]['subdistrict_name']):
                subdistrict_id = result[i]['subdistrict_id']
                break

        try:
            line_data = postdata['line']
            if(line_data == None):
                line_data = ''
        except:
            line_data = ''

        rent_price = ''
        selling_price = ''

        if (post_type == 'RENTAL'):
            rent_price = postdata['price_baht']
            selling_price = ''

        else:
            selling_price = postdata['price_baht']
            rent_price = ''

        boost_data = [
            ('type', property_type[int(postdata['property_type'])]),
            ('post_type', post_type_no),
            ('built_year', '0'),
            ('price', selling_price),
            ('price_rent', rent_price),
            ('land_rai', area_rai),
            ('land_ngaan', area_ngan),
            ('land_sqw', area_sqw),
            ('useable_sqm', living_area),
            ('bedroom', postdata['bed_room']),
            ('bathroom', postdata['bath_room']),
            ('living', ''),
            ('parking', ''),
            ('floor', postdata['floor_total']),
            ('floor_no', postdata['floor_level']),
            ('contact_name', postdata['name']),
            ('contact_phone', postdata['mobile']),
            ('contact_lineid', line_data),
            ('name', postdata['post_title_th']),
           ('detail', postdata['post_description_th']),
            ('district_id', zone_id),
            ('subdistrict_id', subdistrict_id),
            ('address_no', ''),
            ('address_road', ''),
            ('location_lat', postdata['geo_latitude']),
            ('location_lng', postdata['geo_longitude']),
        ]

        response = httprequestObj.http_get('https://www.aecmarketinghome.com/th/post/edit/'+ post_id +'.html')
        soup = BeautifulSoup(response.content, 'html.parser')
        id = soup.find_all("input", {"name": "photo_id[]"})
        for i in range(len(id)):
            boost_data.append(('photo_id[]', id[i].attrs['value']))

        response = httprequestObj.http_post('https://www.aecmarketinghome.com/th/post/save_property/'+ post_id +'.html', data=boost_data)
        result = (response.content.decode('utf-8'))

        if('"status_code":200' in result):
            result = True

        else:
            result = False

        if(result == True):
            detail = "Post Boosted"

        else:
            detail = "Unable to Boost The Post"
        end_time = datetime.datetime.utcnow()

        return {
            "success": result,
            "log_id": postdata['log_id'],
            "start_time": str(start_time),
            "end_time": str(end_time),
            "usage_time": str(end_time - start_time),
            "detail": detail,
            "post_id": post_id,
            "websitename": "aecmarketing"
        }

    def delete_post(self, postdata):

        self.print_debug('function [' + sys._getframe().f_code.co_name + ']')
        start_time = datetime.datetime.utcnow()

        login = self.test_login(postdata)
        if(login['success'] == False):
            return login

        post_id = postdata['post_id']

        delete_post = {
          'prop_id': post_id
        }

        response = httprequestObj.http_post('https://www.aecmarketinghome.com/profile/delete', data=delete_post, headers=self.headers)
        result = json.loads(response.content.decode('utf-8'))['result']['status_code']

        if(result == 200):
            result = True
            detail = "Post Deleted"

        else:
            result = False
            detail = "Could not delete the post"
        end_time = datetime.datetime.utcnow()

        return {
            "success": result,
            "post_id": post_id,
            "start_time": str(start_time),
            "end_time": str(end_time),
            "log_id": postdata['log_id'],
            "usage_time": str(end_time - start_time),
            "detail": detail,
            "websitename": "aecmarketing"
        }

    def edit_post(self, postdata):

        self.print_debug('function [' + sys._getframe().f_code.co_name + ']')
        start_time = datetime.datetime.utcnow()

        property_type = {
            1: 3, 2: 1, 3: 2, 4: 2, 5: 5, 6: 6, 7: 4, 8: 4, 9: 8, 10: 7, 25: 7
        }

        login = self.test_login(postdata)
        if (login['success'] == False):
            return login

        post_id = postdata['post_id']

        if (postdata['listing_type'] == 'เช่า'):
            post_type = 'RENTAL'
            post_type_no = 4

        else:
            post_type = 'SELL'
            post_type_no = 1

        if (postdata['land_size_wa'] == None):
            area_sqw = ''
        else:
            area_sqw = postdata['land_size_wa']

        if (postdata['land_size_rai'] == None):
            area_rai = 0

        else:
            area_rai = postdata['land_size_rai']

        if (postdata['land_size_ngan'] == None):
            area_ngan = ''

        else:
            area_ngan = postdata['land_size_ngan']

        if (postdata['floor_area'] == None):
            living_area = ''

        else:
            living_area = postdata['floor_area']

        zones = ['กรุงเทพฯ - พระนคร', 'กรุงเทพฯ - ดุสิต', 'กรุงเทพฯ - หนองจอก', 'กรุงเทพฯ - บางรัก',
                 'กรุงเทพฯ - บางเขน', 'กรุงเทพฯ - บางกะปิ', 'กรุงเทพฯ - ปทุมวัน', 'กรุงเทพฯ - ป้อมปราบศัตรูพ่าย',
                 'กรุงเทพฯ - พระโขนง', 'กรุงเทพฯ - มีนบุรี', 'กรุงเทพฯ - ลาดกระบัง', 'กรุงเทพฯ - ยานนาวา',
                 'กรุงเทพฯ - สัมพันธวงศ์', 'กรุงเทพฯ - พญาไท', 'กรุงเทพฯ - ธนบุรี', 'กรุงเทพฯ - บางกอกใหญ่',
                 'กรุงเทพฯ - ห้วยขวาง', 'กรุงเทพฯ - คลองสาน', 'กรุงเทพฯ - ตลิ่งชัน', 'กรุงเทพฯ - บางกอกน้อย',
                 'กรุงเทพฯ - บางขุนเทียน', 'กรุงเทพฯ - ภาษีเจริญ', 'กรุงเทพฯ - หนองแขม', 'กรุงเทพฯ - ราษฎร์บูรณะ',
                 'กรุงเทพฯ - บางพลัด', 'กรุงเทพฯ - ดินแดง', 'กรุงเทพฯ - บึงกุ่ม', 'กรุงเทพฯ - สาทร',
                 'กรุงเทพฯ - บางซื่อ', 'กรุงเทพฯ - จตุจักร', 'กรุงเทพฯ - บางคอแหลม', 'กรุงเทพฯ - ประเวศ',
                 'กรุงเทพฯ - คลองเตย', 'กรุงเทพฯ - สวนหลวง', 'กรุงเทพฯ - จอมทอง', 'กรุงเทพฯ - ดอนเมือง',
                 'กรุงเทพฯ - ราชเทวี', 'กรุงเทพฯ - ลาดพร้าว', 'กรุงเทพฯ - วัฒนา', 'กรุงเทพฯ - บางแค',
                 'กรุงเทพฯ - หลักสี่', 'กรุงเทพฯ - สายไหม', 'กรุงเทพฯ - คันนายาว', 'กรุงเทพฯ - สะพานสูง',
                 'กรุงเทพฯ - วังทองหลาง', 'กรุงเทพฯ - คลองสามวา', 'กรุงเทพฯ - บางนา', 'กรุงเทพฯ - ทวีวัฒนา',
                 'กรุงเทพฯ - ทุ่งครุ', 'กรุงเทพฯ - บางบอน', 'กรุงเทพฯ - บ้านทะวาย', 'สมุทรปราการ - เมืองสมุทรปราการ',
                 'สมุทรปราการ - บางบ่อ', 'สมุทรปราการ - บางพลี', 'สมุทรปราการ - พระประแดง',
                 'สมุทรปราการ - พระสมุทรเจดีย์', 'สมุทรปราการ - บางเสาธง', 'นนทบุรี - เมืองนนทบุรี',
                 'นนทบุรี - บางกรวย', 'นนทบุรี - บางใหญ่', 'นนทบุรี - บางบัวทอง', 'นนทบุรี - ไทรน้อย',
                 'นนทบุรี - ปากเกร็ด', 'นนทบุรี - เทศบาลนครนนทบุรี (สาขาแขวงท่าทราย)', 'นนทบุรี - เทศบาลเมืองปากเกร็ด',
                 'ปทุมธานี - เมืองปทุมธานี', 'ปทุมธานี - คลองหลวง', 'ปทุมธานี - ธัญบุรี', 'ปทุมธานี - หนองเสือ',
                 'ปทุมธานี - ลาดหลุมแก้ว', 'ปทุมธานี - ลำลูกกา', 'ปทุมธานี - สามโคก',
                 'ปทุมธานี - ลำลูกกา (สาขาตำบลคูคต)', 'พระนครศรีอยุธยา - พระนครศรีอยุธยา', 'พระนครศรีอยุธยา - ท่าเรือ',
                 'พระนครศรีอยุธยา - นครหลวง', 'พระนครศรีอยุธยา - บางไทร', 'พระนครศรีอยุธยา - บางบาล',
                 'พระนครศรีอยุธยา - บางปะอิน', 'พระนครศรีอยุธยา - บางปะหัน', 'พระนครศรีอยุธยา - ผักไห่',
                 'พระนครศรีอยุธยา - ภาชี', 'พระนครศรีอยุธยา - ลาดบัวหลวง', 'พระนครศรีอยุธยา - วังน้อย',
                 'พระนครศรีอยุธยา - เสนา', 'พระนครศรีอยุธยา - บางซ้าย', 'พระนครศรีอยุธยา - อุทัย',
                 'พระนครศรีอยุธยา - มหาราช', 'พระนครศรีอยุธยา - บ้านแพรก', 'อ่างทอง - เมืองอ่างทอง', 'อ่างทอง - ไชโย',
                 'อ่างทอง - ป่าโมก', 'อ่างทอง - โพธิ์ทอง', 'อ่างทอง - แสวงหา', 'อ่างทอง - วิเศษชัยชาญ',
                 'อ่างทอง - สามโก้', 'ลพบุรี - เมืองลพบุรี', 'ลพบุรี - พัฒนานิคม', 'ลพบุรี - โคกสำโรง',
                 'ลพบุรี - ชัยบาดาล', 'ลพบุรี - ท่าวุ้ง', 'ลพบุรี - บ้านหมี่', 'ลพบุรี - ท่าหลวง', 'ลพบุรี - สระโบสถ์',
                 'ลพบุรี - โคกเจริญ', 'ลพบุรี - ลำสนธิ', 'ลพบุรี - หนองม่วง', 'ลพบุรี - บ้านเช่า',
                 'สิงห์บุรี - เมืองสิงห์บุรี', 'สิงห์บุรี - บางระจัน', 'สิงห์บุรี - ค่ายบางระจัน',
                 'สิงห์บุรี - พรหมบุรี', 'สิงห์บุรี - ท่าช้าง', 'สิงห์บุรี - อินทร์บุรี', 'ชัยนาท - เมืองชัยนาท',
                 'ชัยนาท - มโนรมย์', 'ชัยนาท - วัดสิงห์', 'ชัยนาท - สรรพยา', 'ชัยนาท - สรรคบุรี', 'ชัยนาท - หันคา',
                 'ชัยนาท - หนองมะโมง', 'ชัยนาท - เนินขาม', 'สระบุรี - เมืองสระบุรี', 'สระบุรี - แก่งคอย',
                 'สระบุรี - หนองแค', 'สระบุรี - วิหารแดง', 'สระบุรี - หนองแซง', 'สระบุรี - บ้านหมอ', 'สระบุรี - ดอนพุด',
                 'สระบุรี - หนองโดน', 'สระบุรี - พระพุทธบาท', 'สระบุรี - เสาไห้', 'สระบุรี - มวกเหล็ก',
                 'สระบุรี - วังม่วง', 'สระบุรี - เฉลิมพระเกียรติ', 'ชลบุรี - เมืองชลบุรี', 'ชลบุรี - บ้านบึง',
                 'ชลบุรี - หนองใหญ่', 'ชลบุรี - บางละมุง', 'ชลบุรี - พานทอง', 'ชลบุรี - พนัสนิคม', 'ชลบุรี - ศรีราชา',
                 'ชลบุรี - เกาะสีชัง', 'ชลบุรี - สัตหีบ', 'ชลบุรี - บ่อทอง', 'ชลบุรี - เกาะจันทร์',
                 'ชลบุรี - สัตหีบ (สาขาตำบลบางเสร่)', 'ชลบุรี - ท้องถิ่นเทศบาลเมืองหนองปรือ',
                 'ชลบุรี - เทศบาลตำบลแหลมฉบัง', 'ชลบุรี - เทศบาลเมืองชลบุรี', 'ระยอง - เมืองระยอง', 'ระยอง - บ้านฉาง',
                 'ระยอง - แกลง', 'ระยอง - วังจันทร์', 'ระยอง - บ้านค่าย', 'ระยอง - ปลวกแดง', 'ระยอง - เขาชะเมา',
                 'ระยอง - นิคมพัฒนา', 'ระยอง - สาขาตำบลมาบข่า', 'จันทบุรี - เมืองจันทบุรี', 'จันทบุรี - ขลุง',
                 'จันทบุรี - ท่าใหม่', 'จันทบุรี - โป่งน้ำร้อน', 'จันทบุรี - มะขาม', 'จันทบุรี - แหลมสิงห์',
                 'จันทบุรี - สอยดาว', 'จันทบุรี - แก่งหางแมว', 'จันทบุรี - นายายอาม', 'จันทบุรี - เขาคิชฌกูฏ',
                 'จันทบุรี - กิ่งอำเภอกำพุธ', 'ตราด - เมืองตราด', 'ตราด - คลองใหญ่', 'ตราด - เขาสมิง', 'ตราด - บ่อไร่',
                 'ตราด - แหลมงอบ', 'ตราด - เกาะกูด', 'ตราด - เกาะช้าง', 'ฉะเชิงเทรา - เมืองฉะเชิงเทรา',
                 'ฉะเชิงเทรา - บางคล้า', 'ฉะเชิงเทรา - บางน้ำเปรี้ยว', 'ฉะเชิงเทรา - บางปะกง', 'ฉะเชิงเทรา - บ้านโพธิ์',
                 'ฉะเชิงเทรา - พนมสารคาม', 'ฉะเชิงเทรา - ราชสาส์น', 'ฉะเชิงเทรา - สนามชัยเขต', 'ฉะเชิงเทรา - แปลงยาว',
                 'ฉะเชิงเทรา - ท่าตะเกียบ', 'ฉะเชิงเทรา - คลองเขื่อน', 'ปราจีนบุรี - เมืองปราจีนบุรี',
                 'ปราจีนบุรี - กบินทร์บุรี', 'ปราจีนบุรี - นาดี', 'ปราจีนบุรี - สระแก้ว', 'ปราจีนบุรี - วังน้ำเย็น',
                 'ปราจีนบุรี - บ้านสร้าง', 'ปราจีนบุรี - ประจันตคาม', 'ปราจีนบุรี - ศรีมหาโพธิ',
                 'ปราจีนบุรี - ศรีมโหสถ', 'ปราจีนบุรี - อรัญประเทศ', 'ปราจีนบุรี - ตาพระยา', 'ปราจีนบุรี - วัฒนานคร',
                 'ปราจีนบุรี - คลองหาด', 'นครนายก - เมืองนครนายก', 'นครนายก - ปากพลี', 'นครนายก - บ้านนา',
                 'นครนายก - องครักษ์', 'สระแก้ว - เมืองสระแก้ว', 'สระแก้ว - คลองหาด', 'สระแก้ว - ตาพระยา',
                 'สระแก้ว - วังน้ำเย็น', 'สระแก้ว - วัฒนานคร', 'สระแก้ว - อรัญประเทศ', 'สระแก้ว - เขาฉกรรจ์',
                 'สระแก้ว - โคกสูง', 'สระแก้ว - วังสมบูรณ์', 'นครราชสีมา - เมืองนครราชสีมา', 'นครราชสีมา - ครบุรี',
                 'นครราชสีมา - เสิงสาง', 'นครราชสีมา - คง', 'นครราชสีมา - บ้านเหลื่อม', 'นครราชสีมา - จักราช',
                 'นครราชสีมา - โชคชัย', 'นครราชสีมา - ด่านขุนทด', 'นครราชสีมา - โนนไทย', 'นครราชสีมา - โนนสูง',
                 'นครราชสีมา - ขามสะแกแสง', 'นครราชสีมา - บัวใหญ่', 'นครราชสีมา - ประทาย', 'นครราชสีมา - ปักธงชัย',
                 'นครราชสีมา - พิมาย', 'นครราชสีมา - ห้วยแถลง', 'นครราชสีมา - ชุมพวง', 'นครราชสีมา - สูงเนิน',
                 'นครราชสีมา - ขามทะเลสอ', 'นครราชสีมา - สีคิ้ว', 'นครราชสีมา - ปากช่อง', 'นครราชสีมา - หนองบุญมาก',
                 'นครราชสีมา - แก้งสนามนาง', 'นครราชสีมา - โนนแดง', 'นครราชสีมา - วังน้ำเขียว',
                 'นครราชสีมา - เทพารักษ์', 'นครราชสีมา - เมืองยาง', 'นครราชสีมา - พระทองคำ', 'นครราชสีมา - ลำทะเมนชัย',
                 'นครราชสีมา - บัวลาย', 'นครราชสีมา - สีดา', 'นครราชสีมา - เฉลิมพระเกียรติ',
                 'นครราชสีมา - ท้องถิ่นเทศบาลตำบลโพธิ์กลาง', 'นครราชสีมา - สาขาตำบลมะค่า-พลสงคราม',
                 'นครราชสีมา - โนนลาว', 'บุรีรัมย์ - เมืองบุรีรัมย์', 'บุรีรัมย์ - คูเมือง', 'บุรีรัมย์ - กระสัง',
                 'บุรีรัมย์ - นางรอง', 'บุรีรัมย์ - หนองกี่', 'บุรีรัมย์ - ละหานทราย', 'บุรีรัมย์ - ประโคนชัย',
                 'บุรีรัมย์ - บ้านกรวด', 'บุรีรัมย์ - พุทไธสง', 'บุรีรัมย์ - ลำปลายมาศ', 'บุรีรัมย์ - สตึก',
                 'บุรีรัมย์ - ปะคำ', 'บุรีรัมย์ - นาโพธิ์', 'บุรีรัมย์ - หนองหงส์', 'บุรีรัมย์ - พลับพลาชัย',
                 'บุรีรัมย์ - ห้วยราช', 'บุรีรัมย์ - โนนสุวรรณ', 'บุรีรัมย์ - ชำนิ', 'บุรีรัมย์ - บ้านใหม่ไชยพจน์',
                 'บุรีรัมย์ - โนนดินแดง', 'บุรีรัมย์ - บ้านด่าน', 'บุรีรัมย์ - แคนดง', 'บุรีรัมย์ - เฉลิมพระเกียรติ',
                 'สุรินทร์ - เมืองสุรินทร์', 'สุรินทร์ - ชุมพลบุรี', 'สุรินทร์ - ท่าตูม', 'สุรินทร์ - จอมพระ',
                 'สุรินทร์ - ปราสาท', 'สุรินทร์ - กาบเชิง', 'สุรินทร์ - รัตนบุรี', 'สุรินทร์ - สนม',
                 'สุรินทร์ - ศีขรภูมิ', 'สุรินทร์ - สังขะ', 'สุรินทร์ - ลำดวน', 'สุรินทร์ - สำโรงทาบ',
                 'สุรินทร์ - บัวเชด', 'สุรินทร์ - พนมดงรัก', 'สุรินทร์ - ศรีณรงค์', 'สุรินทร์ - เขวาสินรินทร์',
                 'สุรินทร์ - โนนนารายณ์', 'ศรีสะเกษ - เมืองศรีสะเกษ', 'ศรีสะเกษ - ยางชุมน้อย', 'ศรีสะเกษ - กันทรารมย์',
                 'ศรีสะเกษ - กันทรลักษ์', 'ศรีสะเกษ - ขุขันธ์', 'ศรีสะเกษ - ไพรบึง', 'ศรีสะเกษ - ปรางค์กู่',
                 'ศรีสะเกษ - ขุนหาญ', 'ศรีสะเกษ - ราษีไศล', 'ศรีสะเกษ - อุทุมพรพิสัย', 'ศรีสะเกษ - บึงบูรพ์',
                 'ศรีสะเกษ - ห้วยทับทัน', 'ศรีสะเกษ - โนนคูณ', 'ศรีสะเกษ - ศรีรัตนะ', 'ศรีสะเกษ - น้ำเกลี้ยง',
                 'ศรีสะเกษ - วังหิน', 'ศรีสะเกษ - ภูสิงห์', 'ศรีสะเกษ - เมืองจันทร์', 'ศรีสะเกษ - เบญจลักษ์',
                 'ศรีสะเกษ - พยุห์', 'ศรีสะเกษ - โพธิ์ศรีสุวรรณ', 'ศรีสะเกษ - ศิลาลาด',
                 'อุบลราชธานี - เมืองอุบลราชธานี', 'อุบลราชธานี - ศรีเมืองใหม่', 'อุบลราชธานี - โขงเจียม',
                 'อุบลราชธานี - เขื่องใน', 'อุบลราชธานี - เขมราฐ', 'อุบลราชธานี - ชานุมาน', 'อุบลราชธานี - เดชอุดม',
                 'อุบลราชธานี - นาจะหลวย', 'อุบลราชธานี - น้ำยืน', 'อุบลราชธานี - บุณฑริก', 'อุบลราชธานี - ตระการพืชผล',
                 'อุบลราชธานี - กุดข้าวปุ้น', 'อุบลราชธานี - พนา', 'อุบลราชธานี - ม่วงสามสิบ',
                 'อุบลราชธานี - วารินชำราบ', 'อุบลราชธานี - อำนาจเจริญ', 'อุบลราชธานี - เสนางคนิคม',
                 'อุบลราชธานี - หัวตะพาน', 'อุบลราชธานี - พิบูลมังสาหาร', 'อุบลราชธานี - ตาลสุม',
                 'อุบลราชธานี - โพธิ์ไทร', 'อุบลราชธานี - สำโรง', 'อุบลราชธานี - กิ่งอำเภอลืออำนาจ',
                 'อุบลราชธานี - ดอนมดแดง', 'อุบลราชธานี - สิรินธร', 'อุบลราชธานี - ทุ่งศรีอุดม',
                 'อุบลราชธานี - ปทุมราชวงศา', 'อุบลราชธานี - กิ่งอำเภอศรีหลักชัย', 'อุบลราชธานี - นาเยีย',
                 'อุบลราชธานี - นาตาล', 'อุบลราชธานี - เหล่าเสือโก้ก', 'อุบลราชธานี - สว่างวีระวงศ์',
                 'อุบลราชธานี - น้ำขุ่น', 'อุบลราชธานี - สุวรรณวารี', 'ยโสธร - เมืองยโสธร', 'ยโสธร - ทรายมูล',
                 'ยโสธร - กุดชุม', 'ยโสธร - คำเขื่อนแก้ว', 'ยโสธร - ป่าติ้ว', 'ยโสธร - มหาชนะชัย', 'ยโสธร - ค้อวัง',
                 'ยโสธร - เลิงนกทา', 'ยโสธร - ไทยเจริญ', 'ชัยภูมิ - เมืองชัยภูมิ', 'ชัยภูมิ - บ้านเขว้า',
                 'ชัยภูมิ - คอนสวรรค์', 'ชัยภูมิ - เกษตรสมบูรณ์', 'ชัยภูมิ - หนองบัวแดง', 'ชัยภูมิ - จัตุรัส',
                 'ชัยภูมิ - บำเหน็จณรงค์', 'ชัยภูมิ - หนองบัวระเหว', 'ชัยภูมิ - เทพสถิต', 'ชัยภูมิ - ภูเขียว',
                 'ชัยภูมิ - บ้านแท่น', 'ชัยภูมิ - แก้งคร้อ', 'ชัยภูมิ - คอนสาร', 'ชัยภูมิ - ภักดีชุมพล',
                 'ชัยภูมิ - เนินสง่า', 'ชัยภูมิ - ซับใหญ่', 'ชัยภูมิ - เมืองชัยภูมิ (สาขาตำบลโนนสำราญ)',
                 'ชัยภูมิ - สาขาตำบลบ้านหว่าเฒ่า', 'ชัยภูมิ - หนองบัวแดง (สาขาตำบลวังชมภู)',
                 'ชัยภูมิ - กิ่งอำเภอซับใหญ่ (สาขาตำบลซับใหญ่)', 'ชัยภูมิ - สาขาตำบลโคกเพชร',
                 'ชัยภูมิ - เทพสถิต (สาขาตำบลนายางกลัก)', 'ชัยภูมิ - บ้านแท่น (สาขาตำบลบ้านเต่า)',
                 'ชัยภูมิ - แก้งคร้อ (สาขาตำบลท่ามะไฟหวาน)', 'ชัยภูมิ - คอนสาร (สาขาตำบลโนนคูณ)',
                 'อำนาจเจริญ - เมืองอำนาจเจริญ', 'อำนาจเจริญ - ชานุมาน', 'อำนาจเจริญ - ปทุมราชวงศา', 'อำนาจเจริญ - พนา',
                 'อำนาจเจริญ - เสนางคนิคม', 'อำนาจเจริญ - หัวตะพาน', 'อำนาจเจริญ - ลืออำนาจ', 'บึงกาฬ - เมืองบึงกาฬ',
                 'บึงกาฬ - เซกา', 'บึงกาฬ - โซ่พิสัย', 'บึงกาฬ - พรเจริญ', 'บึงกาฬ - ศรีวิไล', 'บึงกาฬ - บึงโขงหลง',
                 'บึงกาฬ - ปากคาด', 'บึงกาฬ - บุ่งคล้า', 'หนองบัวลำภู - เมืองหนองบัวลำภู', 'หนองบัวลำภู - นากลาง',
                 'หนองบัวลำภู - โนนสัง', 'หนองบัวลำภู - ศรีบุญเรือง', 'หนองบัวลำภู - สุวรรณคูหา', 'หนองบัวลำภู - นาวัง',
                 'ขอนแก่น - เมืองขอนแก่น', 'ขอนแก่น - บ้านฝาง', 'ขอนแก่น - พระยืน', 'ขอนแก่น - หนองเรือ',
                 'ขอนแก่น - ชุมแพ', 'ขอนแก่น - สีชมพู', 'ขอนแก่น - น้ำพอง', 'ขอนแก่น - อุบลรัตน์', 'ขอนแก่น - กระนวน',
                 'ขอนแก่น - บ้านไผ่', 'ขอนแก่น - เปือยน้อย', 'ขอนแก่น - พล', 'ขอนแก่น - แวงใหญ่', 'ขอนแก่น - แวงน้อย',
                 'ขอนแก่น - หนองสองห้อง', 'ขอนแก่น - ภูเวียง', 'ขอนแก่น - มัญจาคีรี', 'ขอนแก่น - ชนบท',
                 'ขอนแก่น - เขาสวนกวาง', 'ขอนแก่น - ภูผาม่าน', 'ขอนแก่น - ซำสูง', 'ขอนแก่น - โคกโพธิ์ไชย',
                 'ขอนแก่น - หนองนาคำ', 'ขอนแก่น - บ้านแฮด', 'ขอนแก่น - โนนศิลา', 'ขอนแก่น - เวียงเก่า',
                 'ขอนแก่น - ท้องถิ่นเทศบาลตำบลบ้านเป็ด', 'ขอนแก่น - เทศบาลตำบลเมืองพล', 'อุดรธานี - เมืองอุดรธานี',
                 'อุดรธานี - กุดจับ', 'อุดรธานี - หนองวัวซอ', 'อุดรธานี - กุมภวาปี', 'อุดรธานี - โนนสะอาด',
                 'อุดรธานี - หนองหาน', 'อุดรธานี - ทุ่งฝน', 'อุดรธานี - ไชยวาน', 'อุดรธานี - ศรีธาตุ',
                 'อุดรธานี - วังสามหมอ', 'อุดรธานี - บ้านดุง', 'อุดรธานี - หนองบัวลำภู', 'อุดรธานี - ศรีบุญเรือง',
                 'อุดรธานี - นากลาง', 'อุดรธานี - สุวรรณคูหา', 'อุดรธานี - โนนสัง', 'อุดรธานี - บ้านผือ',
                 'อุดรธานี - น้ำโสม', 'อุดรธานี - เพ็ญ', 'อุดรธานี - สร้างคอม', 'อุดรธานี - หนองแสง',
                 'อุดรธานี - นายูง', 'อุดรธานี - พิบูลย์รักษ์', 'อุดรธานี - กู่แก้ว', 'อุดรธานี - ประจักษ์ศิลปาคม',
                 'เลย - เมืองเลย', 'เลย - นาด้วง', 'เลย - เชียงคาน', 'เลย - ปากชม', 'เลย - ด่านซ้าย', 'เลย - นาแห้ว',
                 'เลย - ภูเรือ', 'เลย - ท่าลี่', 'เลย - วังสะพุง', 'เลย - ภูกระดึง', 'เลย - ภูหลวง', 'เลย - ผาขาว',
                 'เลย - เอราวัณ', 'เลย - หนองหิน', 'หนองคาย - เมืองหนองคาย', 'หนองคาย - ท่าบ่อ', '- เมืองบึงกาฬ',
                 '- พรเจริญ', 'หนองคาย - โพนพิสัย', '- โซ่พิสัย', 'หนองคาย - ศรีเชียงใหม่', 'หนองคาย - สังคม', '- เซกา',
                 '- ปากคาด', '- บึงโขงหลง', '- ศรีวิไล', '- บุ่งคล้า', 'หนองคาย - สระใคร', 'หนองคาย - เฝ้าไร่',
                 'หนองคาย - รัตนวาปี', 'หนองคาย - โพธิ์ตาก', 'มหาสารคาม - เมืองมหาสารคาม', 'มหาสารคาม - แกดำ',
                 'มหาสารคาม - โกสุมพิสัย', 'มหาสารคาม - กันทรวิชัย', 'มหาสารคาม - เชียงยืน', 'มหาสารคาม - บรบือ',
                 'มหาสารคาม - นาเชือก', 'มหาสารคาม - พยัคฆภูมิพิสัย', 'มหาสารคาม - วาปีปทุม', 'มหาสารคาม - นาดูน',
                 'มหาสารคาม - ยางสีสุราช', 'มหาสารคาม - กุดรัง', 'มหาสารคาม - ชื่นชม', 'มหาสารคาม - หลุบ',
                 'ร้อยเอ็ด - เมืองร้อยเอ็ด', 'ร้อยเอ็ด - เกษตรวิสัย', 'ร้อยเอ็ด - ปทุมรัตต์',
                 'ร้อยเอ็ด - จตุรพักตรพิมาน', 'ร้อยเอ็ด - ธวัชบุรี', 'ร้อยเอ็ด - พนมไพร', 'ร้อยเอ็ด - โพนทอง',
                 'ร้อยเอ็ด - โพธิ์ชัย', 'ร้อยเอ็ด - หนองพอก', 'ร้อยเอ็ด - เสลภูมิ', 'ร้อยเอ็ด - สุวรรณภูมิ',
                 'ร้อยเอ็ด - เมืองสรวง', 'ร้อยเอ็ด - โพนทราย', 'ร้อยเอ็ด - อาจสามารถ', 'ร้อยเอ็ด - เมยวดี',
                 'ร้อยเอ็ด - ศรีสมเด็จ', 'ร้อยเอ็ด - จังหาร', 'ร้อยเอ็ด - เชียงขวัญ', 'ร้อยเอ็ด - หนองฮี',
                 'ร้อยเอ็ด - ทุ่งเขาหลวง', 'กาฬสินธุ์ - เมืองกาฬสินธุ์', 'กาฬสินธุ์ - นามน', 'กาฬสินธุ์ - กมลาไสย',
                 'กาฬสินธุ์ - ร่องคำ', 'กาฬสินธุ์ - กุฉินารายณ์', 'กาฬสินธุ์ - เขาวง', 'กาฬสินธุ์ - ยางตลาด',
                 'กาฬสินธุ์ - ห้วยเม็ก', 'กาฬสินธุ์ - สหัสขันธ์', 'กาฬสินธุ์ - คำม่วง', 'กาฬสินธุ์ - ท่าคันโท',
                 'กาฬสินธุ์ - หนองกุงศรี', 'กาฬสินธุ์ - สมเด็จ', 'กาฬสินธุ์ - ห้วยผึ้ง', 'กาฬสินธุ์ - สามชัย',
                 'กาฬสินธุ์ - นาคู', 'กาฬสินธุ์ - ดอนจาน', 'กาฬสินธุ์ - ฆ้องชัย', 'สกลนคร - เมืองสกลนคร',
                 'สกลนคร - กุสุมาลย์', 'สกลนคร - กุดบาก', 'สกลนคร - พรรณานิคม', 'สกลนคร - พังโคน', 'สกลนคร - วาริชภูมิ',
                 'สกลนคร - นิคมน้ำอูน', 'สกลนคร - วานรนิวาส', 'สกลนคร - คำตากล้า', 'สกลนคร - บ้านม่วง',
                 'สกลนคร - อากาศอำนวย', 'สกลนคร - สว่างแดนดิน', 'สกลนคร - ส่องดาว', 'สกลนคร - เต่างอย',
                 'สกลนคร - โคกศรีสุพรรณ', 'สกลนคร - เจริญศิลป์', 'สกลนคร - โพนนาแก้ว', 'สกลนคร - ภูพาน',
                 'สกลนคร - วานรนิวาส', 'สกลนคร - บ้านหัน', 'นครพนม - เมืองนครพนม', 'นครพนม - ปลาปาก',
                 'นครพนม - ท่าอุเทน', 'นครพนม - บ้านแพง', 'นครพนม - ธาตุพนม', 'นครพนม - เรณูนคร', 'นครพนม - นาแก',
                 'นครพนม - ศรีสงคราม', 'นครพนม - นาหว้า', 'นครพนม - โพนสวรรค์', 'นครพนม - นาทม', 'นครพนม - วังยาง',
                 'มุกดาหาร - เมืองมุกดาหาร', 'มุกดาหาร - นิคมคำสร้อย', 'มุกดาหาร - ดอนตาล', 'มุกดาหาร - ดงหลวง',
                 'มุกดาหาร - คำชะอี', 'มุกดาหาร - หว้านใหญ่', 'มุกดาหาร - หนองสูง', 'เชียงใหม่ - เมืองเชียงใหม่',
                 'เชียงใหม่ - จอมทอง', 'เชียงใหม่ - แม่แจ่ม', 'เชียงใหม่ - เชียงดาว', 'เชียงใหม่ - ดอยสะเก็ด',
                 'เชียงใหม่ - แม่แตง', 'เชียงใหม่ - แม่ริม', 'เชียงใหม่ - สะเมิง', 'เชียงใหม่ - ฝาง',
                 'เชียงใหม่ - แม่อาย', 'เชียงใหม่ - พร้าว', 'เชียงใหม่ - สันป่าตอง', 'เชียงใหม่ - สันกำแพง',
                 'เชียงใหม่ - สันทราย', 'เชียงใหม่ - หางดง', 'เชียงใหม่ - ฮอด', 'เชียงใหม่ - ดอยเต่า',
                 'เชียงใหม่ - อมก๋อย', 'เชียงใหม่ - สารภี', 'เชียงใหม่ - เวียงแหง', 'เชียงใหม่ - ไชยปราการ',
                 'เชียงใหม่ - แม่วาง', 'เชียงใหม่ - แม่ออน', 'เชียงใหม่ - ดอยหล่อ',
                 'เชียงใหม่ - เทศบาลนครเชียงใหม่ (สาขาแขวงกาลวิละ)', 'เชียงใหม่ - เทศบาลนครเชียงใหม่ (สาขาแขวงศรีวิชั)',
                 'เชียงใหม่ - เทศบาลนครเชียงใหม่ (สาขาเม็งราย)', 'ลำพูน - เมืองลำพูน', 'ลำพูน - แม่ทา',
                 'ลำพูน - บ้านโฮ่ง', 'ลำพูน - ลี้', 'ลำพูน - ทุ่งหัวช้าง', 'ลำพูน - ป่าซาง', 'ลำพูน - บ้านธิ',
                 'ลำพูน - เวียงหนองล่อง', 'ลำปาง - เมืองลำปาง', 'ลำปาง - แม่เมาะ', 'ลำปาง - เกาะคา', 'ลำปาง - เสริมงาม',
                 'ลำปาง - งาว', 'ลำปาง - แจ้ห่ม', 'ลำปาง - วังเหนือ', 'ลำปาง - เถิน', 'ลำปาง - แม่พริก',
                 'ลำปาง - แม่ทะ', 'ลำปาง - สบปราบ', 'ลำปาง - ห้างฉัตร', 'ลำปาง - เมืองปาน',
                 'อุตรดิตถ์ - เมืองอุตรดิตถ์', 'อุตรดิตถ์ - ตรอน', 'อุตรดิตถ์ - ท่าปลา', 'อุตรดิตถ์ - น้ำปาด',
                 'อุตรดิตถ์ - ฟากท่า', 'อุตรดิตถ์ - บ้านโคก', 'อุตรดิตถ์ - พิชัย', 'อุตรดิตถ์ - ลับแล',
                 'อุตรดิตถ์ - ทองแสนขัน', 'แพร่ - เมืองแพร่', 'แพร่ - ร้องกวาง', 'แพร่ - ลอง', 'แพร่ - สูงเม่น',
                 'แพร่ - เด่นชัย', 'แพร่ - สอง', 'แพร่ - วังชิ้น', 'แพร่ - หนองม่วงไข่', 'น่าน - เมืองน่าน',
                 'น่าน - แม่จริม', 'น่าน - บ้านหลวง', 'น่าน - นาน้อย', 'น่าน - ปัว', 'น่าน - ท่าวังผา',
                 'น่าน - เวียงสา', 'น่าน - ทุ่งช้าง', 'น่าน - เชียงกลาง', 'น่าน - นาหมื่น', 'น่าน - สันติสุข',
                 'น่าน - บ่อเกลือ', 'น่าน - สองแคว', 'น่าน - ภูเพียง', 'น่าน - เฉลิมพระเกียรติ', 'พะเยา - เมืองพะเยา',
                 'พะเยา - จุน', 'พะเยา - เชียงคำ', 'พะเยา - เชียงม่วน', 'พะเยา - ดอกคำใต้', 'พะเยา - ปง',
                 'พะเยา - แม่ใจ', 'พะเยา - ภูซาง', 'พะเยา - ภูกามยาว', 'เชียงราย - เมืองเชียงราย',
                 'เชียงราย - เวียงชัย', 'เชียงราย - เชียงของ', 'เชียงราย - เทิง', 'เชียงราย - พาน', 'เชียงราย - ป่าแดด',
                 'เชียงราย - แม่จัน', 'เชียงราย - เชียงแสน', 'เชียงราย - แม่สาย', 'เชียงราย - แม่สรวย',
                 'เชียงราย - เวียงป่าเป้า', 'เชียงราย - พญาเม็งราย', 'เชียงราย - เวียงแก่น', 'เชียงราย - ขุนตาล',
                 'เชียงราย - แม่ฟ้าหลวง', 'เชียงราย - แม่ลาว', 'เชียงราย - เวียงเชียงรุ้ง', 'เชียงราย - ดอยหลวง',
                 'แม่ฮ่องสอน - เมืองแม่ฮ่องสอน', 'แม่ฮ่องสอน - ขุนยวม', 'แม่ฮ่องสอน - ปาย', 'แม่ฮ่องสอน - แม่สะเรียง',
                 'แม่ฮ่องสอน - แม่ลาน้อย', 'แม่ฮ่องสอน - สบเมย', 'แม่ฮ่องสอน - ปางมะผ้า', 'แม่ฮ่องสอน - ม่วยต่อ',
                 'นครสวรรค์ - เมืองนครสวรรค์', 'นครสวรรค์ - โกรกพระ', 'นครสวรรค์ - ชุมแสง', 'นครสวรรค์ - หนองบัว',
                 'นครสวรรค์ - บรรพตพิสัย', 'นครสวรรค์ - เก้าเลี้ยว', 'นครสวรรค์ - ตาคลี', 'นครสวรรค์ - ท่าตะโก',
                 'นครสวรรค์ - ไพศาลี', 'นครสวรรค์ - พยุหะคีรี', 'นครสวรรค์ - ลาดยาว', 'นครสวรรค์ - ตากฟ้า',
                 'นครสวรรค์ - แม่วงก์', 'นครสวรรค์ - แม่เปิน', 'นครสวรรค์ - ชุมตาบง', 'นครสวรรค์ - สาขาตำบลห้วยน้ำหอม',
                 'นครสวรรค์ - กิ่งอำเภอชุมตาบง (สาขาตำบลชุมตาบง)', 'นครสวรรค์ - แม่วงก์ (สาขาตำบลแม่เล่ย์)',
                 'อุทัยธานี - เมืองอุทัยธานี', 'อุทัยธานี - ทัพทัน', 'อุทัยธานี - สว่างอารมณ์', 'อุทัยธานี - หนองฉาง',
                 'อุทัยธานี - หนองขาหย่าง', 'อุทัยธานี - บ้านไร่', 'อุทัยธานี - ลานสัก', 'อุทัยธานี - ห้วยคต',
                 'กำแพงเพชร - เมืองกำแพงเพชร', 'กำแพงเพชร - ไทรงาม', 'กำแพงเพชร - คลองลาน',
                 'กำแพงเพชร - ขาณุวรลักษบุรี', 'กำแพงเพชร - คลองขลุง', 'กำแพงเพชร - พรานกระต่าย',
                 'กำแพงเพชร - ลานกระบือ', 'กำแพงเพชร - ทรายทองวัฒนา', 'กำแพงเพชร - ปางศิลาทอง',
                 'กำแพงเพชร - บึงสามัคคี', 'กำแพงเพชร - โกสัมพีนคร', 'ตาก - เมืองตาก', 'ตาก - บ้านตาก', 'ตาก - สามเงา',
                 'ตาก - แม่ระมาด', 'ตาก - ท่าสองยาง', 'ตาก - แม่สอด', 'ตาก - พบพระ', 'ตาก - อุ้มผาง', 'ตาก - วังเจ้า',
                 'ตาก - กิ่งอำเภอท่าปุย', 'สุโขทัย - เมืองสุโขทัย', 'สุโขทัย - บ้านด่านลานหอย', 'สุโขทัย - คีรีมาศ',
                 'สุโขทัย - กงไกรลาศ', 'สุโขทัย - ศรีสัชนาลัย', 'สุโขทัย - ศรีสำโรง', 'สุโขทัย - สวรรคโลก',
                 'สุโขทัย - ศรีนคร', 'สุโขทัย - ทุ่งเสลี่ยม', 'พิษณุโลก - เมืองพิษณุโลก', 'พิษณุโลก - นครไทย',
                 'พิษณุโลก - ชาติตระการ', 'พิษณุโลก - บางระกำ', 'พิษณุโลก - บางกระทุ่ม', 'พิษณุโลก - พรหมพิราม',
                 'พิษณุโลก - วัดโบสถ์', 'พิษณุโลก - วังทอง', 'พิษณุโลก - เนินมะปราง', 'พิจิตร - เมืองพิจิตร',
                 'พิจิตร - วังทรายพูน', 'พิจิตร - โพธิ์ประทับช้าง', 'พิจิตร - ตะพานหิน', 'พิจิตร - บางมูลนาก',
                 'พิจิตร - โพทะเล', 'พิจิตร - สามง่าม', 'พิจิตร - ทับคล้อ', 'พิจิตร - สากเหล็ก', 'พิจิตร - บึงนาราง',
                 'พิจิตร - ดงเจริญ', 'พิจิตร - วชิรบารมี', 'เพชรบูรณ์ - เมืองเพชรบูรณ์', 'เพชรบูรณ์ - ชนแดน',
                 'เพชรบูรณ์ - หล่มสัก', 'เพชรบูรณ์ - หล่มเก่า', 'เพชรบูรณ์ - วิเชียรบุรี', 'เพชรบูรณ์ - ศรีเทพ',
                 'เพชรบูรณ์ - หนองไผ่', 'เพชรบูรณ์ - บึงสามพัน', 'เพชรบูรณ์ - น้ำหนาว', 'เพชรบูรณ์ - วังโป่ง',
                 'เพชรบูรณ์ - เขาค้อ', 'ราชบุรี - เมืองราชบุรี', 'ราชบุรี - จอมบึง', 'ราชบุรี - สวนผึ้ง',
                 'ราชบุรี - ดำเนินสะดวก', 'ราชบุรี - บ้านโป่ง', 'ราชบุรี - บางแพ', 'ราชบุรี - โพธาราม',
                 'ราชบุรี - ปากท่อ', 'ราชบุรี - วัดเพลง', 'ราชบุรี - บ้านคา', 'ราชบุรี - ท้องถิ่นเทศบาลตำบลบ้านฆ้อง',
                 'กาญจนบุรี - เมืองกาญจนบุรี', 'กาญจนบุรี - ไทรโยค', 'กาญจนบุรี - บ่อพลอย', 'กาญจนบุรี - ศรีสวัสดิ์',
                 'กาญจนบุรี - ท่ามะกา', 'กาญจนบุรี - ท่าม่วง', 'กาญจนบุรี - ทองผาภูมิ', 'กาญจนบุรี - สังขละบุรี',
                 'กาญจนบุรี - พนมทวน', 'กาญจนบุรี - เลาขวัญ', 'กาญจนบุรี - ด่านมะขามเตี้ย', 'กาญจนบุรี - หนองปรือ',
                 'กาญจนบุรี - ห้วยกระเจา', 'กาญจนบุรี - สาขาตำบลท่ากระดาน', 'กาญจนบุรี - บ้านทวน',
                 'สุพรรณบุรี - เมืองสุพรรณบุรี', 'สุพรรณบุรี - เดิมบางนางบวช', 'สุพรรณบุรี - ด่านช้าง',
                 'สุพรรณบุรี - บางปลาม้า', 'สุพรรณบุรี - ศรีประจันต์', 'สุพรรณบุรี - ดอนเจดีย์',
                 'สุพรรณบุรี - สองพี่น้อง', 'สุพรรณบุรี - สามชุก', 'สุพรรณบุรี - อู่ทอง', 'สุพรรณบุรี - หนองหญ้าไซ',
                 'นครปฐม - เมืองนครปฐม', 'นครปฐม - กำแพงแสน', 'นครปฐม - นครชัยศรี', 'นครปฐม - ดอนตูม',
                 'นครปฐม - บางเลน', 'นครปฐม - สามพราน', 'นครปฐม - พุทธมณฑล', 'สมุทรสาคร - เมืองสมุทรสาคร',
                 'สมุทรสาคร - กระทุ่มแบน', 'สมุทรสาคร - บ้านแพ้ว', 'สมุทรสงคราม - เมืองสมุทรสงคราม',
                 'สมุทรสงคราม - บางคนที', 'สมุทรสงคราม - อัมพวา', 'เพชรบุรี - เมืองเพชรบุรี', 'เพชรบุรี - เขาย้อย',
                 'เพชรบุรี - หนองหญ้าปล้อง', 'เพชรบุรี - ชะอำ', 'เพชรบุรี - ท่ายาง', 'เพชรบุรี - บ้านลาด',
                 'เพชรบุรี - บ้านแหลม', 'เพชรบุรี - แก่งกระจาน', 'ประจวบคีรีขันธ์ - เมืองประจวบคีรีขันธ์',
                 'ประจวบคีรีขันธ์ - กุยบุรี', 'ประจวบคีรีขันธ์ - ทับสะแก', 'ประจวบคีรีขันธ์ - บางสะพาน',
                 'ประจวบคีรีขันธ์ - บางสะพานน้อย', 'ประจวบคีรีขันธ์ - ปราณบุรี', 'ประจวบคีรีขันธ์ - หัวหิน',
                 'ประจวบคีรีขันธ์ - สามร้อยยอด', 'นครศรีธรรมราช - เมืองนครศรีธรรมราช', 'นครศรีธรรมราช - พรหมคีรี',
                 'นครศรีธรรมราช - ลานสกา', 'นครศรีธรรมราช - ฉวาง', 'นครศรีธรรมราช - พิปูน', 'นครศรีธรรมราช - เชียรใหญ่',
                 'นครศรีธรรมราช - ชะอวด', 'นครศรีธรรมราช - ท่าศาลา', 'นครศรีธรรมราช - ทุ่งสง', 'นครศรีธรรมราช - นาบอน',
                 'นครศรีธรรมราช - ทุ่งใหญ่', 'นครศรีธรรมราช - ปากพนัง', 'นครศรีธรรมราช - ร่อนพิบูลย์',
                 'นครศรีธรรมราช - สิชล', 'นครศรีธรรมราช - ขนอม', 'นครศรีธรรมราช - หัวไทร', 'นครศรีธรรมราช - บางขัน',
                 'นครศรีธรรมราช - ถ้ำพรรณรา', 'นครศรีธรรมราช - จุฬาภรณ์', 'นครศรีธรรมราช - พระพรหม',
                 'นครศรีธรรมราช - นบพิตำ', 'นครศรีธรรมราช - ช้างกลาง', 'นครศรีธรรมราช - เฉลิมพระเกียรติ',
                 'นครศรีธรรมราช - เชียรใหญ่ (สาขาตำบลเสือหึง)', 'นครศรีธรรมราช - สาขาตำบลสวนหลวง',
                 'นครศรีธรรมราช - ร่อนพิบูลย์ (สาขาตำบลหินตก)', 'นครศรีธรรมราช - หัวไทร (สาขาตำบลควนชะลิก)',
                 'นครศรีธรรมราช - ทุ่งสง (สาขาตำบลกะปาง)', 'กระบี่ - เมืองกระบี่', 'กระบี่ - เขาพนม',
                 'กระบี่ - เกาะลันตา', 'กระบี่ - คลองท่อม', 'กระบี่ - อ่าวลึก', 'กระบี่ - ปลายพระยา', 'กระบี่ - ลำทับ',
                 'กระบี่ - เหนือคลอง', 'พังงา - เมืองพังงา', 'พังงา - เกาะยาว', 'พังงา - กะปง', 'พังงา - ตะกั่วทุ่ง',
                 'พังงา - ตะกั่วป่า', 'พังงา - คุระบุรี', 'พังงา - ทับปุด', 'พังงา - ท้ายเหมือง',
                 'ภูเก็ต - เมืองภูเก็ต', 'ภูเก็ต - กะทู้', 'ภูเก็ต - ถลาง', 'ภูเก็ต - ทุ่งคา',
                 'สุราษฎร์ธานี - เมืองสุราษฎร์ธานี', 'สุราษฎร์ธานี - กาญจนดิษฐ์', 'สุราษฎร์ธานี - ดอนสัก',
                 'สุราษฎร์ธานี - เกาะสมุย', 'สุราษฎร์ธานี - เกาะพะงัน', 'สุราษฎร์ธานี - ไชยา', 'สุราษฎร์ธานี - ท่าชนะ',
                 'สุราษฎร์ธานี - คีรีรัฐนิคม', 'สุราษฎร์ธานี - บ้านตาขุน', 'สุราษฎร์ธานี - พนม',
                 'สุราษฎร์ธานี - ท่าฉาง', 'สุราษฎร์ธานี - บ้านนาสาร', 'สุราษฎร์ธานี - บ้านนาเดิม',
                 'สุราษฎร์ธานี - เคียนซา', 'สุราษฎร์ธานี - เวียงสระ', 'สุราษฎร์ธานี - พระแสง', 'สุราษฎร์ธานี - พุนพิน',
                 'สุราษฎร์ธานี - ชัยบุรี', 'สุราษฎร์ธานี - วิภาวดี', 'สุราษฎร์ธานี - เกาะพงัน',
                 'สุราษฎร์ธานี - บ้านดอน', 'ระนอง - เมืองระนอง', 'ระนอง - ละอุ่น', 'ระนอง - กะเปอร์', 'ระนอง - กระบุรี',
                 'ระนอง - สุขสำราญ', 'ชุมพร - เมืองชุมพร', 'ชุมพร - ท่าแซะ', 'ชุมพร - ปะทิว', 'ชุมพร - หลังสวน',
                 'ชุมพร - ละแม', 'ชุมพร - พะโต๊ะ', 'ชุมพร - สวี', 'ชุมพร - ทุ่งตะโก', 'สงขลา - เมืองสงขลา',
                 'สงขลา - สทิงพระ', 'สงขลา - จะนะ', 'สงขลา - นาทวี', 'สงขลา - เทพา', 'สงขลา - สะบ้าย้อย',
                 'สงขลา - ระโนด', 'สงขลา - กระแสสินธุ์', 'สงขลา - รัตภูมิ', 'สงขลา - สะเดา', 'สงขลา - หาดใหญ่',
                 'สงขลา - นาหม่อม', 'สงขลา - ควนเนียง', 'สงขลา - บางกล่ำ', 'สงขลา - สิงหนคร', 'สงขลา - คลองหอยโข่ง',
                 'สงขลา - ท้องถิ่นเทศบาลตำบลสำนักขาม', 'สงขลา - เทศบาลตำบลบ้านพรุ', 'สตูล - เมืองสตูล', 'สตูล - ควนโดน',
                 'สตูล - ควนกาหลง', 'สตูล - ท่าแพ', 'สตูล - ละงู', 'สตูล - ทุ่งหว้า', 'สตูล - มะนัง',
                 'ตรัง - เมืองตรัง', 'ตรัง - กันตัง', 'ตรัง - ย่านตาขาว', 'ตรัง - ปะเหลียน', 'ตรัง - สิเกา',
                 'ตรัง - ห้วยยอด', 'ตรัง - วังวิเศษ', 'ตรัง - นาโยง', 'ตรัง - รัษฎา', 'ตรัง - หาดสำราญ',
                 'ตรัง - อำเภอเมืองตรัง(สาขาคลองเต็ง)', 'พัทลุง - เมืองพัทลุง', 'พัทลุง - กงหรา', 'พัทลุง - เขาชัยสน',
                 'พัทลุง - ตะโหมด', 'พัทลุง - ควนขนุน', 'พัทลุง - ปากพะยูน', 'พัทลุง - ศรีบรรพต', 'พัทลุง - ป่าบอน',
                 'พัทลุง - บางแก้ว', 'พัทลุง - ป่าพะยอม', 'พัทลุง - ศรีนครินทร์', 'ปัตตานี - เมืองปัตตานี',
                 'ปัตตานี - โคกโพธิ์', 'ปัตตานี - หนองจิก', 'ปัตตานี - ปะนาเระ', 'ปัตตานี - มายอ',
                 'ปัตตานี - ทุ่งยางแดง', 'ปัตตานี - สายบุรี', 'ปัตตานี - ไม้แก่น', 'ปัตตานี - ยะหริ่ง',
                 'ปัตตานี - ยะรัง', 'ปัตตานี - กะพ้อ', 'ปัตตานี - แม่ลาน', 'ยะลา - เมืองยะลา', 'ยะลา - เบตง',
                 'ยะลา - บันนังสตา', 'ยะลา - ธารโต', 'ยะลา - ยะหา', 'ยะลา - รามัน', 'ยะลา - กาบัง', 'ยะลา - กรงปินัง',
                 'นราธิวาส - เมืองนราธิวาส', 'นราธิวาส - ตากใบ', 'นราธิวาส - บาเจาะ', 'นราธิวาส - ยี่งอ',
                 'นราธิวาส - ระแงะ', 'นราธิวาส - รือเสาะ', 'นราธิวาส - ศรีสาคร', 'นราธิวาส - แว้ง',
                 'นราธิวาส - สุคิริน', 'นราธิวาส - สุไหงโก-ลก', 'นราธิวาส - สุไหงปาดี', 'นราธิวาส - จะแนะ',
                 'นราธิวาส - เจาะไอร้อง', 'นราธิวาส - บางนร']

        zone_id = -1

        if (postdata['addr_district'][:4] == 'เขต '):
            postdata['addr_district'] = postdata['addr_district'][4:]

        for i in range(len(zones)):

            if (postdata['addr_district'] in zones[i]):
                zone_id = i + 1
                break

        if (zone_id == -1):

            for i in range(len(zones)):
                if (postdata['addr_province'] in zones[i]):
                    zone_id = i + 1
                    break

        addr_subdis = postdata['addr_sub_district']
        response = httprequestObj.http_get('https://www.aecmarketinghome.com/th/post/get_subdistrict/' + str(zone_id))
        result = json.loads(response.content.decode('utf-8'))

        subdistrict_id = ''
        for i in range(len(result)):
            if (addr_subdis in result[i]['subdistrict_name']):
                subdistrict_id = result[i]['subdistrict_id']
                break

        try:
            line_data = postdata['line']
            if (line_data == None):
                line_data = ''
        except:
            line_data = ''

        image_string = []
        if (postdata['post_images'] != None):
            allimages = postdata['post_images']
            for i in range(len(allimages)):
                with open(os.getcwd() + "/" + allimages[i], 'rb') as img_file:
                    encode = 'data:image/jpeg;base64,' + str(base64.b64encode(img_file.read()))[2:-1]
                image_string.append(encode)

        else:
            with open(os.getcwd() + "/" + 'imgtmp/default/white.png', 'rb') as img_file:
                encode = 'data:image/jpeg;base64,' + str(base64.b64encode(img_file.read()))[2:-1]
            image_string.append(encode)

        rent_price = ''
        selling_price = ''

        if (post_type == 'RENTAL'):
            rent_price = postdata['price_baht']
            selling_price = ''

        else:
            selling_price = postdata['price_baht']
            rent_price = ''

        edit_data = [
            ('type', property_type[int(postdata['property_type'])]),
            ('post_type', post_type_no),
            ('built_year', '0'),
            ('price', selling_price),
            ('price_rent', rent_price),
            ('land_rai', area_rai),
            ('land_ngaan', area_ngan),
            ('land_sqw', area_sqw),
            ('useable_sqm', living_area),
            ('bedroom', postdata['bed_room']),
            ('bathroom', postdata['bath_room']),
            ('living', ''),
            ('parking', ''),
            ('photos[]', image_string),
            ('floor', postdata['floor_total']),
            ('floor_no', postdata['floor_level']),
            ('contact_name', postdata['name']),
            ('contact_phone', postdata['mobile']),
            ('contact_lineid', line_data),
            ('name', postdata['post_title_th']),
            ('detail', postdata['post_description_th']),
            ('district_id', zone_id),
            ('subdistrict_id', subdistrict_id),
            ('address_no', ''),
            ('address_road', ''),
            ('location_lat', postdata['geo_latitude']),
            ('location_lng', postdata['geo_longitude']),
        ]

        # response = httprequestObj.http_get('https://www.aecmarketinghome.com/th/post/edit/' + post_id + '.html')
        # soup = BeautifulSoup(response.content, 'html.parser')
        # id = soup.find_all("input", {"name": "photo_id[]"})
        # for i in range(len(id)):
        #     edit_data.append(('photo_id[]', id[i].attrs['value']))

        response = httprequestObj.http_post(
            'https://www.aecmarketinghome.com/th/post/save_property/' + post_id + '.html', data=edit_data)
        result = (response.content.decode('utf-8'))

        if ('"status_code":200' in result):
            result = True

        else:
            result = False

        if (result == True):
            detail = "Post Edited"

        else:
            detail = "Unable to Edit The Post"
        end_time = datetime.datetime.utcnow()

        return {
            "success": result,
            "start_time": str(start_time),
            "end_time": str(end_time),
            "usage_time": str(end_time - start_time),
            "log_id": postdata['log_id'],
            "detail": detail,
            "post_id": post_id,
            "websitename": "aecmarketing"
        }

    def search_post(self, postdata):
        self.print_debug('function [' + sys._getframe().f_code.co_name + ']')
        start_time = datetime.datetime.utcnow()

        time_start = datetime.datetime.utcnow()
        post_url = ""
        user = postdata['user']
        password = postdata['pass']


        login = self.test_login(postdata)

        if(login['success'] == False):
            return  login

        itr = 0

        exists = False
        post_id = 0
        post_titles = postdata['post_title_th']

        while(exists == False):

            response = httprequestObj.http_get('https://www.aecmarketinghome.com/th/profile/index/'+ str(itr) +'.html')
            soup = BeautifulSoup(response.content, 'html.parser')
            post_div = soup.find_all("div", {"class" : "dashboard-wrapper list-mypost"})
            titles = post_div[0].find_all("div", {"class" : "row"})

            if(len(titles) == 0):
                break

            for title in titles:
                    title_text = title.find("div", {"class" : "col-sm-12 col-md-5"}).select("b")
                    if(post_titles == title_text[0].text):
                        exists = True
                        post_url = title.select("a")[0].attrs['href']
                        post_id = int(title.select('a')[1].attrs['href'][46:-5])
                        break

            itr += 1

        if(exists == True):
            result = True
            detail = "Post found successfully"

        else:
            result = False
            post_url = ''
            detail = 'No post found with given title'

        end_time = datetime.datetime.utcnow()
        return {
            "success": "true",
            "start_time": str(start_time),
            "end_time": str(end_time),
            "usage_time": str(end_time - start_time),
            "post_found" : result,
            "log_id" : 1,
            "account_type" : "",
            "detail": detail,
            "post_id": post_id,
            "post_url" : post_url,
            "post_create_time": "",
            "post_modify_time": "",
            "post_view": "",
            "websitename": "aecmarketinghome"
        }


    def print_debug(self, msg):
        if(self.debug == 1):
            print(msg)
        return True

    def print_debug_data(self, data):
        if(self.debugdata == 1):
            print(data)
        return True

        if(self.debugdata == 1):
            print(data)
        return True

